{ 
	"sets" : {
		"1" : {
			"name" : "Basic",
			"releaseDate" : "10/2008"
		},
		"2" : {
			"name" : "Promo",
			"releaseDate" : "3/2009"
		},
		"3" : {
			"name" : "Intrigue",
			"releaseDate" : "7/2009"
		},
		"4" : {
			"name" : "Seaside",
			"releaseDate" : "10/2009"
		},
		"5" : {
			"name" : "Alchemy",
			"releaseDate" : "5/2010"
		},
		"6" : {
			"name" : "Prosperity",
			"releaseDate" : "10/2010"
		},
		"7" : {
			"name" : "Cornucopia",
			"releaseDate" : "6/2011"
		},
		"8" : {
			"name" : "Hinterlands",
			"releaseDate" : "10/2011"
		},
		"9" : {
			"name" : "Dark Ages",
			"releaseDate" : ""
		},
		"10" : {
			"name" : "Guilds",
			"releaseDate" : ""
		}
	},
	"cards" : [
		{
			"name" : "Adventurer",
			"setId" : 1,
			"isAction" : true,
			"cost" : 6,
			"description" : "Reveal cards from your deck until you reveal 2 Treasure cards. Put those Treasure cards into your hand and discard the other revealed cards.",
			"errata" : "If you have to shuffle in the middle, shuffle. Don't shuffle in the revealed cards as these cards do not go to the Discard pile until you have finished revealing cards. If you run out of cards after shuffling and still only have one Treasure, you get just that one Treasure."
		},
		{
			"name" : "Bureaucrat",
			"setId" : 1,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 4,
			"description" : "Gain a Silver Card: put it on top of your deck. Each other player reveals a Victory card from his hand and puts it on his deck (or reveals a hand with no Victory cards)",
			"errata" : "If you have no cards left in your Deck when you play this card, the Silver you gain will become the only card in your Deck. Similarly, if another player has no cards in his Deck, the Victory card he puts on top will become the only card in his Deck."
		},
		{
			"name" : "Cellar",
			"setId" : 1,
			"isAction" : true,
			"cost" : 2,
			"actions" : 1,
			"description" : "Discard any number of cards. +1 Card per card discarded.",
			"errata" : "You can't discard Cellar to itself, since it isn't in your hand any longer when you resolve it. You choose what cards to discard and discard them all at once. You only draw cards after you have discarded. If you have to shuffle to do the drawing, the discarded cards will end up shuffled into your new Deck."
		},
		{
			"name" : "Chancellor",
			"setId" : 1,
			"isAction" : true,
			"cost" : 3,
			"coins" : 2,
			"description" : "You may immediately put your deck into your discard pile.",
			"errata" : "You must resolve the Chancellor (decide whether or not to discard your Deck by flipping it into your Discard pile) before doing other things on your turn, like deciding what to buy or playing another Action card. You may not look through your Deck as you discard it."
		},
		{
			"name" : "Chapel",
			"setId" : 1,
			"isAction" : true,
			"cost" : 2,
			"description" : "Trash up to 4 cards from your hand.",
			"errata" : "You can't trash the Chapel itself since it isn't in your hand when you resolve it. You could trash a different Chapel card if that card were in your hand."
		},
		{
			"name" : "Council Room",
			"setId" : 1,
			"isAction" : true,
			"cost" : 5,
			"cards" : 4,
			"buys" : 1,
			"description" : "Each other player draws a card.",
			"errata" : "The other players must draw a card whether they want to or not. All players should shuffle as necessary."
		},
		{
			"name" : "Feast",
			"setId" : 1,
			"isAction" : true,
			"cost" : 4,
			"description" : "Trash this card. Gain a card costing up to 5 coins.",
			"errata" : "The gained card goes into your Discard pile. It has to be a card from the Supply. You cannot use coins from Treasures or previous Actions (like the Market) to increase the cost of the card that you gain. If you use Throne Room on Feast, you will gain two cards, even though you can only trash Feast once. Gaining the card isn't contingent on trashing Feast; they're just two things that the card tries to make you do."
		},
		{
			"name" : "Festival",
			"setId" : 1,
			"isAction" : true,
			"cost" : 5,
			"actions" : 1,
			"coins" : 2,
			"buys" : 1,
			"description" : "",
			"errata" : "If you are playing multiple Festivals, keep a careful count of your Actions. Say how many you have left out loud; this trick works every time (i.e. \"I'm playing the Festival and now have two Actions remaining. I play a Market and have two Actions remaining. I play another Festival and now have three Actions remaining....\")."
		},
		{
			"name" : "Gardens",
			"setId" : 1,
			"isVictory" : true,
			"cost" : 4,
			"description" : "Worth 1 VP for every 10 cards in your deck (rounded down).",
			"errata" : "This Kingdom card is a Victory card, not an Action card. It does nothing until the end of the game, when it is worth 1 victory point per 10 cards in your Deck (counting all of your cards – your Discard pile and hand are combined with your Deck before scoring). Round down; if you have 39 cards, Gardens is worth 3 victory points. During set-up, place 12 Gardens in the Supply for a 3 or 4 player game and 8 in the Supply for a 2 player game."
		},
		{
			"name" : "Laboratory",
			"setId" : 1,
			"isAction" : true,
			"cost" : 5,
			"cards" : 2,
			"actions" : 1,
			"description" : "",
			"errata" : "Draw two cards. You may play another Action card during your Action phase."
		},
		{
			"name" : "Library",
			"setId" : 1,
			"isAction" : true,
			"cost" : 5,
			"description" : "Draw until you have 7 cards in hand. You may set aside any Action cards drawn this way, as you draw them, discard the set aside cards after you finish drawing.",
			"errata" : "If you have to shuffle in the middle, the set-aside cards are not shuffled into the new Deck. They will be discarded when you have finished drawing cards. If you run out of cards even after shuffling, you just get however many there were. You are not obligated to set aside Actions – you just have the option to do so. If you have 7 or more cards in hand after you play the Library, you don't draw any cards."
		},
		{
			"name" : "Market",
			"setId" : 1,
			"isAction" : true,
			"cost" : 5,
			"cards" : 1,
			"actions" : 1,
			"coins" : 1,
			"buys" : 1,
			"description" : "",
			"errata" : "Draw a card. You may play another Action card during your Action phase. During your Buy phase, you may buy an additional card from the supply, and add one coin to the total value of the Treasure cards played."
		},
		{
			"name" : "Militia",
			"setId" : 1,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 4,
			"coins" : 2,
			"description" : "Each other player discards down to 3 cards in his hand.",
			"errata" : "The attacked players discard cards until they have only 3 cards in hand. Players who had 3 or fewer cards in hand when Militia was played do not discard any cards."
		},
		{
			"name" : "Mine",
			"setId" : 1,
			"isAction" : true,
			"cost" : 5,
			"description" : "Trash a Treasure card from your hand. Gain a Treasure card costing up to 3 coins more, put it into your hand.",
			"errata" : "Generally, you can trash a Copper card and gain a Silver, or trash a Silver card and gain a Gold. However, you could also trash a Treasure to gain the same Treasure or a cheaper one. The gained card goes in your hand; thus, you can spend it the same turn. If you don't have a Treasure card in your hand to trash, you can’t gain anything."
		},
		{
			"name" : "Moat",
			"setId" : 1,
			"isAction" : true,
			"isReaction" : true,
			"cost" : 2,
			"cards" : 2,
			"description" : "[Action]: Draw 2 cards. [Reaction]: When another player plays an Attack card, you may reveal this from your hand. If you do, you are unaffected by that attack.",
			"errata" : "An Attack card is one that says \"Attack\" on the bottom line (usually, \"Action - Attack\"). When someone else plays an Attack card, you may reveal the Moat by showing it from your hand to the other players and then returning it to your hand (before the Attack card resolves). You are then unaffected by that Attack card. You won't gain a Curse because of a Witch or reveal a card to a Spy, and so on. It's just like you aren't in the game for purposes of resolving that Attack. Moat doesn't stop anything an Attack does to other players or to the player of the Attack; for example, if everyone else Moats a Witch, the person who played it still gets to draw 2 cards. Moat can also be played on your turn as an Action to draw 2 cards."
		},
		{
			"name" : "Moneylender",
			"setId" : 1,
			"isAction" : true,
			"cost" : 4,
			"description" : "Trash a Copper card from your hand. If you do, +3 coins.",
			"errata" : "If you do not have a Copper in your hand to trash, you don't get the +3 coins to spend in the Buy phase."
		},
		{
			"name" : "Remodel",
			"setId" : 1,
			"isAction" : true,
			"cost" : 4,
			"description" : "Trash a card from your hand. Gain a card costing up to 2 coins more than the trashed card.",
			"errata" : "You cannot trash the Remodel as it isn't in your hand when you resolve it (you can trash a different Remodel card from your hand). If you do not have a card to trash, you cannot gain a card from the Remodel. The gained card goes in your Discard pile. You can only gain cards from the Supply. The gained card need not cost exactly 2 coins more than the trashed card; it can cost that much or any amount less. You cannot use coins from Treasures or previous Actions (like the Market) to increase the cost of the card you gain. You can trash a card to gain a copy of the same card."
		},
		{
			"name" : "Smithy",
			"setId" : 1,
			"isAction" : true,
			"cost" : 4,
			"cards" : 3,
			"description" : "",
			"errata" : "Draw three cards."
		},
		{
			"name" : "Spy",
			"setId" : 1,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 4,
			"cards" : 1,
			"actions" : 1,
			"description" : "Each player (including you) reveals the top card of his deck and either discards it or puts it back, your choice.",
			"errata" : "Spy causes all players, including the one who played it, to reveal the top card of their Deck. Note that you draw your card for playing Spy before any cards are revealed. Anyone who does not have any cards left in their Deck shuffles in order to have something to reveal. Anyone who still has no cards to reveal doesn't reveal one. If players care about the order in which things happen for this, you do yourself first, then each other player in turn order. Revealed cards that aren't discarded are returned to the top of their players' Decks."
		},
		{
			"name" : "Thief",
			"setId" : 1,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 4,
			"description" : "Each other player reveals the top 2 cards of his deck. If they revealed ant Treasure cards, they trash one of them that you choose. You may gain any or all of these trashed cards. They discard the other revealed cards.",
			"errata" : "A player with just one card left reveals that last card and then shuffles to get the other card to reveal (without including the revealed card); a player with no cards left shuffles to get both of them. A player who still doesn't have two cards to reveal after shuffling just reveals what he can. Each player trashes one Treasure card at most, of the attacker's choice from the two revealed cards, and then you gain any of the trashed cards that you want. You can only take Treasures just trashed—not ones trashed on previous turns. You can take none of them, all of them, or anything in between. Put the Treasures you decided to gain into your Discard pile. The ones you choose not to gain stay in the Trash pile."
		},
		{
			"name" : "Throne Room",
			"setId" : 1,
			"isAction" : true,
			"cost" : 4,
			"description" : "Choose an Action card in your hand. Play it Twice.",
			"errata" : "You pick another Action card in your hand, play it, and play it again. The second use of the Action card doesn't use up any extra Actions you have. You completely resolve playing the Action the first time before playing it the second time. If you Throne Room a Throne Room, you play an Action, doing it twice, and then play another Action and do it twice; you do not resolve an Action four times. If you Throne Room a card that gives you +1 Action, such as Market, you will end up with 2 Actions left afterwards, which is tricky, because if you'd just played Market twice you'd only have 1 Action left afterwards. Remember to count the number of Actions you have remaining out loud to keep from getting confused! You cannot play any other Actions in between playing the Throne Roomed Action twice."
		},
		{
			"name" : "Village",
			"setId" : 1,
			"isAction" : true,
			"cost" : 3,
			"cards" : 1,
			"actions" : 2,
			"description" : "",
			"errata" : "If you're playing multiple Villages, keep a careful count of your Actions. Say how many you have left out loud; this trick works every time."
		},
		{
			"name" : "Witch",
			"setId" : 1,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 5,
			"cards" : 2,
			"description" : "Each other player gains a Curse card.",
			"errata" : "If there aren't enough Curses left to go around when you play the Witch, you deal them out in turn order – starting with the player after you. If you play Witch with no Curses remaining, you will still draw 2 cards. A player gaining a Curse puts it face-up into his Discard pile."
		},
		{
			"name" : "Woodcutter",
			"setId" : 1,
			"isAction" : true,
			"cost" : 3,
			"coins" : 2,
			"buys" : 1,
			"description" : "",
			"errata" : "During your Buy phase, you add two coins to the total value of the Treasure cards played, and you may buy an additional card from the Supply."
		},
		{
			"name" : "Workshop",
			"setId" : 1,
			"isAction" : true,
			"cost" : 3,
			"description" : "Gain a card costing up to 4 coins.",
			"errata" : "The card you gain is put into your Discard pile. It has to be a card from the Supply. You cannot use coins from Treasures or previous Actions (like the Market) to increase the cost of the card you may gain."
		},
		{
			"name" : "Black Market",
			"setId" : 2,
			"isAction" : true,
			"cost" : 3,
			"coins" : 2,
			"description" : "Reveal the top 3 cards of the Black Market deck. You may buy one of them immediately. Put the unbought cards on the bottom of the Black Market deck in any order. (Before the game, make a Black Market deck out of one copy of each Kingdom card not in the supply.)",
			"errata" : ""
		},
		{
			"name" : "Envoy",
			"setId" : 2,
			"isAction" : true,
			"cost" : 4,
			"description" : "Reveal the top 5 cards of your deck. The player to the left chooses one for you to discard. Draw the rest.",
			"errata" : ""
		},
		{
			"name" : "Baron",
			"setId" : 3,
			"isAction" : true,
			"cost" : 4,
			"buys" : 1,
			"description" : "You may discard an estate card. If you do, +4 Coin. Otherwise, gain an estate card.",
			"errata" : "You are never obligated to discard an Estate, even if you have one in your hand. However, if you do not discard an Estate, you must gain an Estate (if there are any left); you cannot choose to just get +1 Buy from this card."
		},
		{
			"name" : "Bridge",
			"setId" : 3,
			"isAction" : true,
			"cost" : 4,
			"coins" : 1,
			"buys" : 1,
			"description" : "All cards (including cards in players' hands) cost 1 Coin less this turn, but no less than 0 Coin.",
			"errata" : "Costs are 1 coin lower for all purposes. For example, if you played Village, then Bridge, then Workshop, you could use Workshop to gain a Duchy (because Duchy now costs 4 coins due to the Bridge). Then if you played 3 coins, you could buy a Silver (for 2 coins) and an Estate (for 1 coin). Cards in players' decks are also affected. The effect is cumulative; if you Throne Room a Bridge, all cards will cost 2 coins less this turn. Costs never go below 0 coins. For this reason, if you play Bridge and then play Upgrade, you could trash a Copper (which still costs zero, even though you played Bridge) and gain a Pawn (which costs 1 after Bridge is played)."
		},
		{
			"name" : "Conspirator",
			"setId" : 3,
			"isAction" : true,
			"cost" : 4,
			"coins" : 2,
			"description" : "If you played 3 or more actions this turn (counting this): +1 Card, +1 Action",
			"errata" : "You evaluate whether or not Conspirator gives you +1 Card and +1 Action when you play it. If later in the turn you play more Action cards, you do not go back and reevaluate a Conspirator played earlier. For the purposes of counting actions, if you Throne Room an Action, that's one Action for the Throne Room, one for the selected Action played the first time, and one for the selected Action played the second time. For example, if you play Throne Room on Conspirator, the first Conspirator will be your second Action, and won't give you +1 Card or +1 Action, but the second Conspirator will be your third Action, and you will get +1 Card and +1 Action for that second Conspirator. Action - Victory cards are Actions."
		},
		{
			"name" : "Coppersmith",
			"setId" : 3,
			"isAction" : true,
			"cost" : 4,
			"description" : "Copper produces an extra 1 Coin this turn.",
			"errata" : "This just changes how much money you get when playing Copper. The effect is cumulative; if you use Throne Room on Coppersmith, each Copper that you play that turn will produce 3 coins."
		},
		{
			"name" : "Courtyard",
			"setId" : 3,
			"isAction" : true,
			"cost" : 2,
			"cards" : 3,
			"description" : "Put a card from your hand on top of your deck.",
			"errata" : "You draw cards and add them to your hand before putting one back. The card you put on top of your deck can be any card in your new hand and doesn't have to be one of the 3 you just drew."
		},
		{
			"name" : "Duke",
			"setId" : 3,
			"isVictory" : true,
			"cost" : 5,
			"description" : "Worth 1 VP for each Duchy you have.",
			"errata" : "This does nothing until the end of the game, at which time it's worth 1 <v> per Duchy you have. This counts all of your cards - your Discard pile and hand are part of your Deck at that point. During set-up, place 12 Dukes in the Supply for a 3- or 4- player game and 8 in the Supply for a 2-player game."
		},
		{
			"name" : "Great Hall",
			"setId" : 3,
			"isAction" : true,
			"isVictory" : true,
			"cost" : 3,
			"cards" : 1,
			"actions" : 1,
			"victoryPoints" : 1,
			"description" : "",
			"errata" : "This is both an Action card and a Victory card. When you play it, you draw a card and may play another Action. At the end of the game, it's worth 1 <v>, like an Estate. During set-up, place 12 Great Halls in the Supply for a 3- or 4-player game and 8 in the Supply for a 2-player game."
		},
		{
			"name" : "Harem",
			"setId" : 3,
			"isTreasure" : true,
			"isVictory" : true,
			"cost" : 6,
			"coins" : 2,
			"victoryPoints" : 2,
			"description" : "",
			"errata" : "This is both a Treasure card and a Victory card. You can play it for 2 coins, just like a Silver card. At the end of the game, it's worth 2 <v>. During set-up, place 12 Harems in the Supply for a 3- or 4-player game and 8 in the Supply for a 2-player game."
		},
		{
			"name" : "Ironworks",
			"setId" : 3,
			"isAction" : true,
			"cost" : 4,
			"description" : "Gain a card costing up to 4 coins. If it is an Action card, +1 Action. Treasure card, +1 Coin. Victory card, +1 Card.",
			"errata" : "The card you gain must be from the Supply and is put into your discard pile. You get a bonus depending on what type of card you gained. A card with 2 types gives you both bonuses; if you use Ironworks to gain a Great Hall, you will then draw a card (because Great Hall is a Victory card) and may play another Action (because Great Hall is an Action card). Costs of cards are affected by Bridge."
		},
		{
			"name" : "Masquerade",
			"setId" : 3,
			"isAction" : true,
			"cost" : 3,
			"coins" : 2,
			"description" : "Each player passes a card from his hand to the left at once. Then you may trash a card from your hand.",
			"errata" : "First you draw 2 cards. Next, each player (all at the same time) chooses a card from his hand and places it face down on the table between him and the player to his left. The player to the left then puts that card into his hand. Cards are passed simultaneously, so you may not look at the card you are receiving until you have chosen a card to pass. Finally, you may trash a card from your hand. Only the player who played Masquerade may trash a card. This is not an Attack and cannot be responded to with Moat or Secret Chamber."
		},
		{
			"name" : "Mining Village",
			"setId" : 3,
			"isAction" : true,
			"cost" : 4,
			"cards" : 1,
			"actions" : 2,
			"description" : "You may trash this card immediately, If you do, +2 coins.",
			"errata" : "You must decide whether to trash Mining Village or not before moving on to other actions or other phases. You get a card and +2 Actions, whether you choose to trash it or not. If you trash it you also get +2 Coins. If you Throne Room a Mining Village, you cannot trash Mining Village twice. You will get +1 Card, +2 Actions, and +2 Coins the first time you play it and trash it and when you play it the second time with the Throne Room you get +1 Card and +2 Actions but cannot trash it again."
		},
		{
			"name" : "Minion",
			"setId" : 3,
			"isAction" : true,
			"cost" : 5,
			"actions" : 1,
			"description" : "Choose one: +2 coins, or discard your hand, + 4 cards, and each other player with at least 5 cards in hand discards his hand and draws 4 cards.",
			"errata" : "You get +1 Action whichever option you choose. The options are +2 coins, or everything after that - discarding, drawing 4 cards, and other players discarding and drawing. A player who Moats this neither discards nor draws. Other players are only affected by this if they have 5 or more cards in hand. Other players can use Secret Chamber when you play Minion even if they do not have 5 or more cards in hand."
		},
		{
			"name" : "Nobles",
			"setId" : 3,
			"isAction" : true,
			"isVictory" : true,
			"cost" : 6,
			"victoryPoints" : 2,
			"description" : "Choose one: +3 cards, or +2 actions.",
			"errata" : "This is both an Action card and a Victory card. When you play it, you choose either to draw 3 cards or to get 2 more Actions to use; you cannot mix and match. At the end of the game, this is worth 2 <v>. During set-up, place 12 Nobles in the Supply for a 3- or 4-player game and 8 in the Supply for a 2-player game."
		},
		{
			"name" : "Pawn",
			"setId" : 3,
			"isAction" : true,
			"cost" : 2,
			"description" : "Choose two: +1 Card, +1 Action, +1 Buy, +1 Coin. (The choices must be different)",
			"errata" : "First pick any 2 of the 4 options. You cannot pick the same option twice. After picking both, do both, in either order. You may not choose to draw a card, look at the card drawn, and then make your second choice."
		},
		{
			"name" : "Saboteur",
			"setId" : 3,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 5,
			"description" : "Each other player reveals cards from the top of his deck until revealing one costing 3 coins or more. He trashes that card and may gain a card costing at most 2 coins less than it. He discards the other revealed cards.",
			"errata" : "Each other player turns over the top cards of his deck until he reveals one costing 3 coins or more. If a player needs to shuffle to continue revealing cards, he does not shuffle in the already revealed cards. If he goes through all of his cards without finding a card costing 3 coins or more, he just discards everything revealed and is done. If he does find a card costing 3 coins or more, he trashes it, and then may choose to gain a card costing at most 2 coins less than the trashed card. For example, if he trashed a card costing 5 coins, he may gain a card costing up to 3 coins. The gained card must be from the Supply and is put into his discard pile, as are his revealed cards. Costs of cards are affected by Bridge."
		},
		{
			"name" : "Scout",
			"setId" : 3,
			"isAction" : true,
			"cost" : 4,
			"description" : "Reveal the top 4 cards of your deck. Put the revealed Victory cards into your hand. Put the other cards on top your deck in any order.",
			"errata" : "If there are fewer than 4 cards left in your deck, reveal all the cards in your deck, shuffle your discard pile (which does not include currently revealed cards), and then reveal the remainder needed. Action - Victory cards are Victory cards. Curse cards are not Victory cards. Take all revealed Victory cards into your hand; you cannot choose to leave some on top. You do not have to reveal the order that you put cards back in."
		},
		{
			"name" : "Secret Chamber",
			"setId" : 3,
			"isAction" : true,
			"isReaction" : true,
			"cost" : 2,
			"description" : "[Action]: Discard any number of cards. +1 Coin for per card discarded. [Reaction]: When another player plays an Attack card, you may reveal this from your hand. If you do, +2 cards, then put 2 cards from your hand on top of your deck.",
			"errata" : "When you play this as an Action on your turn, you first discard any number of cards from your hand, then get 1 coin per card you discarded. You may choose to discard zero cards, but then you will get zero additional coins. The other ability does nothing at that time as it is only used as a Reaction. When someone else plays an Attack card, you may reveal Secret Chamber from your hand. If you do, first you draw 2 cards, then you put any 2 cards from your hand on top of your deck (in any order). The cards you put back do not have to be the ones you drew. You can put Secret Chamber itself on top of your deck; it's still in your hand when you reveal it. Revealing Secret Chamber happens prior to resolving what an Attack does to you. For example, if another player plays Thief, you can reveal Secret Chamber, draw 2 cards, put 2 back, and then you resolve getting hit by the Thief. You can reveal Secret Chamber whenever another player plays an Attack card, even if that Attack would not affect you. Also, you can reveal more than one Reaction card in response to an Attack. For example, after revealing the Secret Chamber in response to an Attack and resolving the effect of the Secret Chamber, you can still reveal a Moat to avoid the Attack completely."
		},
		{
			"name" : "Shanty Town",
			"setId" : 3,
			"isAction" : true,
			"cost" : 3,
			"actions" : 2,
			"description" : "Reveal your hand. If you have no actions cards in hand, +2 cards.",
			"errata" : "You get 2 more Actions to use no matter what else happens. Then you must reveal your hand. If you have no Action cards in hand, you draw 2 cards. If the first card you draw is an Action card, you still draw the second card. Action - Victory cards are Action cards."
		},
		{
			"name" : "Steward",
			"setId" : 3,
			"isAction" : true,
			"cost" : 3,
			"description" : "Choose one: +2 cards, or +2 coins, or trash 2 cards from your hand.",
			"errata" : "If you choose to trash 2 cards and have 2 or more cards in your hand after playing the Steward, then you must trash exactly 2 cards. You may choose to trash 2 cards, even if you only have 1 card left in your hand after playing the Steward; just trash the remaining card in your hand. You cannot mix and match - you either draw 2 cards, get 2 coins, or trash 2 cards."
		},
		{
			"name" : "Swindler",
			"setId" : 3,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 3,
			"coins" : 2,
			"description" : "Each other player trashes the top card of his deck and gains a card of the same cost that you choose.",
			"errata" : "A player with no cards left in his Deck shuffles first; a player who still has no cards does not trash a card or gain a card. If the order matters (such as when piles are running low), resolve Swindler in turn order starting with the player to your left. Gained cards go to discard piles. If a player trashes a 0-cost card such as Copper, you may choose to give him Curse (if there are any left). You can give a player another copy of the same card he trashed. The gained cards have to be ones from the Supply, and you have to pick a card that's left if you can (you cannot pick an empty pile). If there are no cards in the Supply with the same cost as a given player's trashed card, no card is gained by that player. A player who Moats this does not reveal a card from his deck, and so neither trashes a card nor gains a card."
		},
		{
			"name" : "Torturer",
			"setId" : 3,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 5,
			"cards" : 3,
			"description" : "Each other player chooses one: he discards 2 cards, or he gains a Curse card, putting it in his hand.",
			"errata" : "Each other player chooses which option to suffer and then suffers it. A player can choose to gain a Curse even when there are no Curses left, in which case he doesn't gain one; and a player can choose to discard 2 cards even if he has no cards in hand or one card in hand (if he has one card, he discards that single card). Gained Curses go to the players' hands rather than their discard piles. If there aren't enough Curses left for everybody, deal them around in turn order starting with the player to your left. When the order matters (such as with very few Curses left), each player makes his decision of which fate to suffer in turn order."
		},
		{
			"name" : "Trading Post",
			"setId" : 3,
			"isAction" : true,
			"cost" : 5,
			"description" : "Trash 2 cards from your hand. If you do, gain a Silver card, put it into your hand.",
			"errata" : "If you have 2 or more cards, you must trash exactly 2 cards and gain a Silver card. The gained Silver card goes into your hand and can be spent the same turn. If the Silver pile is empty, you do not gain a Silver card (but still trash cards if possible). If you only have one card left in your hand and you play Trading Post, you trash the one remaining card but you do not gain a Silver. If you have no cards left when you play this, nothing happens."
		},
		{
			"name" : "Tribute",
			"setId" : 3,
			"isAction" : true,
			"cost" : 5,
			"description" : "The player to your left reveals and then discards the top 2 cards of his deck. For each different named card revealed, if it is an... Action card, +2 actions, Treasure card, +2 coins, Victory Card, +2 cards",
			"errata" : "If the player after you has fewer than 2 cards left in his deck, he reveals all the cards in his deck, shuffles his discard pile (which does not include currently revealed cards), and then reveals the remainder needed. The player then discards the revealed cards. If the player after you does not have enough cards to reveal 2, he reveals what he can. You get bonuses for the types of cards revealed, counting only the different cards. A card with 2 types gives you both bonuses. So if the player to your left reveals Copper and Harem, you get +4 coins and +2 cards; if he reveals 2 Silvers, you just get +2 coins. Curse produces no bonus."
		},
		{
			"name" : "Upgrade",
			"setId" : 3,
			"isAction" : true,
			"cost" : 5,
			"cards" : 1,
			"actions" : 1,
			"description" : "Trash a card form your hand. Gain a card costing exactly 1 Coin more than it.",
			"errata" : "Draw a card first. Then, you must trash a card from your hand and gain a card costing exactly 1 coin more than the trashed card. The gained card has to be a card in the Supply, and it goes into your discard pile. If there are no cards available for that cost, you do not get one (you still trashed a card though). If you do not have a card in your hand to trash, you neither trash nor gain a card. Card costs are affected by Bridge. Since Bridge affects the costs of the card you trash and the card you gain, in most cases the Bridge will have no net effect. But since cards cannot go below zero in cost, a Bridge played before an Upgrade would allow you to trash a Copper (cost of zero, even with the Bridge) and gain an Estate (cost of 1 as a result of the Bridge)."
		},
		{
			"name" : "Wishing Well",
			"setId" : 3,
			"isAction" : true,
			"cost" : 3,
			"cards" : 1,
			"actions" : 1,
			"description" : "Name a card. Reveal the top card of your deck. If it's the named card, put it into your hand.",
			"errata" : "First you draw your card. Then name a card (\"Copper,\" for example - not \"Treasure\") and reveal the top card of your deck; if you named the same card you revealed, put the revealed card in your hand. If you do not name the right card, you put the revealed card back on top."
		},
		{
			"name" : "Ambassador",
			"setId" : 4,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 3,
			"description" : "Reveal a card from your hand. Return up to 2 copies of it from your hand to the Supply. Then each other player gains a copy of it.",
			"errata" : "First you reveal a card from your hand. Then take 0, 1, or 2 copies of that card from your hand and put them on top of their Supply pile. Then each other player gains a copy of that card from the Supply. If there are not enough copies to go around, deal them out in turn order, starting with the player to your left."
		},
		{
			"name" : "Bazaar",
			"setId" : 4,
			"isAction" : true,
			"cost" : 5,
			"cards" : 1,
			"actions" : 2,
			"coins" : 1,
			"description" : "",
			"errata" : "You draw a card and get +2 Actions and +<1>."
		},
		{
			"name" : "Caravan",
			"setId" : 4,
			"isAction" : true,
			"isDuration" : true,
			"cost" : 4,
			"cards" : 1,
			"actions" : 1,
			"description" : "At the start of your next turn, +1 Card.",
			"errata" : "You draw a card and get +1 Action when you play this, and then you draw another card at the start of your next turn."
		},
		{
			"name" : "Cutpurse",
			"setId" : 4,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 4,
			"coins" : 2,
			"description" : "Each other player discards a Copper card (or reveals a hand with no Copper).",
			"errata" : "Each of your opponents with at least one Copper in hand discards one Copper. Each of your opponents with no Coppers in hand reveals their hand to prove this."
		},
		{
			"name" : "Embargo",
			"setId" : 4,
			"isAction" : true,
			"cost" : 2,
			"coins" : 2,
			"description" : "Trash this card. Put an Embargo token on top of a Supply pile. When a player buys a card, he gains a Curse card per Embargo token on that pile.",
			"errata" : "The token can go on any Supply pile - a Kingdom card pile such as Embargo, or a base card pile such as Silver. The token modifies the pile, so that anyone buying a card from that pile gains a Curse. This even affects the player who placed the Embargo token. This is cumulative; with three Embargo tokens on a pile, buying a card from that pile will give you three Curses. Embargo tokens do not do anything if a card is gained without being bought, such as with Smugglers, or if the Curse pile is empty. Embargo tokens are not counter-limited; use a replacement if necessary. If you Throne Room Embargo, you will get +<4> and place two tokens, even though you can only trash Embargo once."
		},
		{
			"name" : "Explorer",
			"setId" : 4,
			"isAction" : true,
			"cost" : 5,
			"description" : "You may reveal a Province card from your hand. If you do, gain a Gold card, putting it into your hand. Otherwise, gain a Silver card, putting it into your hand.",
			"errata" : "You do not have to reveal a Province if you have one. If you do reveal one you gain a Gold, otherwise you gain a Silver. The gained card comes from the Supply and is put into your hand; it can be played the same turn."
		},
		{
			"name" : "Fishing Village",
			"setId" : 4,
			"isAction" : true,
			"isDuration" : true,
			"cost" : 3,
			"actions" : 2,
			"coins" : 1,
			"description" : "At the start of your next turn: +1 Action, +1 Coin.",
			"errata" : "You get +2 Actions and +<1> when you play this, and then +1 Action and +<1> at the start of your next turn."
		},
		{
			"name" : "Ghost Ship",
			"setId" : 4,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 5,
			"cards" : 2,
			"description" : "Each other player with 4 or more cards in hand puts cards from his hand on top of his deck until he has 3 cards in his hand.",
			"errata" : "Each other player keeps putting cards from their hand onto their deck, in any order they choose, until they only have 3 cards in hand. Players who already had 3 or fewer cards in hand do not put any cards onto their deck."
		},
		{
			"name" : "Haven",
			"setId" : 4,
			"isAction" : true,
			"isDuration" : true,
			"cost" : 2,
			"cards" : 1,
			"actions" : 1,
			"description" : "Set aside a card from your hand face down. At the start of your next turn, put it into your hand.",
			"errata" : "First draw a card and get +1 Action; then choose a card from your hand and set it aside face down under Haven. You may look at it, but other players may not. You have to set aside a card if you can. At the start of your next turn, return the set aside card to your hand."
		},
		{
			"name" : "Island",
			"setId" : 4,
			"isAction" : true,
			"isVictory" : true,
			"cost" : 4,
			"victoryPoints" : 2,
			"description" : "Set aside this and another card from your hand. Return them to your deck at the end of the game.",
			"errata" : "When you set aside your first Island, take an Island player mat to put it on. Island and the set aside card are face up on the mat; anyone can look at them. They stay there until the end of the game, when you return them to your deck and count your score. When playing Island, you have to set aside a card if you can. If you Throne Room an Island, you set aside two cards with it. Use 8 copies of Island for games with 2 players, 12 for games with 3 or more players."
		},
		{
			"name" : "Lighthouse",
			"setId" : 4,
			"isAction" : true,
			"isDuration" : true,
			"cost" : 2,
			"actions" : 1,
			"description" : "Now and at the start of your next turn: +1 Coin. While this is in play, when another player plays an Attack card, it doesn't affect you.",
			"errata" : "You get +1 Action and +<1> when you play this, and then you get +<1> at the start of your next turn. Also, while Lighthouse is in play, other players' Attack cards do not affect you (even if you want them to). This does not prevent you from using Reactions when other players play Attacks."
		},
		{
			"name" : "Lookout",
			"setId" : 4,
			"isAction" : true,
			"cost" : 3,
			"actions" : 1,
			"description" : "Look at the top 3 cards of your deck. Trash one of them. Discard one of them. Put the other one on top of your deck.",
			"errata" : "You do the things in order - first trash one of the cards, then discard one, then put the last one on top of your deck. So if there is only one card (even after shuffling), you trash it, and if there are only 2 cards, you trash one then discard the other."
		},
		{
			"name" : "Merchant Ship",
			"setId" : 4,
			"isAction" : true,
			"isDuration" : true,
			"cost" : 5,
			"coins" : 2,
			"description" : "Now and at the start of your next turn: +2 coins.",
			"errata" : "You get +<2> when you play this and another +<2> at the start of your next turn."
		},
		{
			"name" : "Native Village",
			"setId" : 4,
			"isAction" : true,
			"cost" : 2,
			"actions" : 2,
			"description" : "Choose one: Set aside the top card of your deck face down on your Native Village mat, or put all the cards from your mat into your hand. You may look at the cards on your mat at any time, return them to your deck at the end of the game.",
			"errata" : "When you play this, you either take all of the cards from your mat, or set aside the top card of your deck on your mat. When you first set aside a card with Native Village, take a Native Village mat to put the cards on. You can look at the cards on your mat whenever you like, but other players cannot. You may choose either option even if there are no cards in your deck or no cards on your mat. You cannot look at the top card before deciding whether to set it aside or take the cards from the mat. At the end of the game, all cards from the mat are returned to your deck for scoring."
		},
		{
			"name" : "Navigator",
			"setId" : 4,
			"isAction" : true,
			"cost" : 4,
			"coins" : 2,
			"description" : "Look at the top 5 cards of your deck. Either discard all of them, or put them back on top of your deck in any order.",
			"errata" : "You discard all 5 cards (or however many were left after shuffling) or none of them. If you do not discard them, put them back in any order."
		},
		{
			"name" : "Outpost",
			"setId" : 4,
			"isAction" : true,
			"isDuration" : true,
			"cost" : 5,
			"description" : "You only draw 3 cards (instead of 5) in this turn's Clean-up phase. Take an extra turn after this one. This can't cause you to take more than two consecutive turns.",
			"errata" : "Outpost only does anything the first time you play it in a turn, and only if the previous turn was another player's (meaning, you are not already taking an extra turn). If these conditions are met, you take an extra turn, and only draw 3 cards for your next hand rather than 5 (thus usually only having 3 cards in hand on the extra turn). Except for the smaller starting hand, the extra turn is a normal turn. If you play e.g. Merchant Ship in the same turn as Outpost, the extra turn will be when you get the +<2> from Merchant Ship. Extra turns do not count towards the tiebreaker of which tied player had fewer turns."
		},
		{
			"name" : "Pearl Diver",
			"setId" : 4,
			"isAction" : true,
			"cost" : 2,
			"cards" : 1,
			"actions" : 1,
			"description" : "Look at the bottom card of your deck. You may put it on top.",
			"errata" : "First draw a card and get +1 Action; then look at the bottom card of your deck, shuffling first if needed. If you choose to put the bottom card on top of your deck, be sure not to look at the card above it."
		},
		{
			"name" : "Pirate Ship",
			"setId" : 4,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 4,
			"description" : "Choose one: Each other player reveals the top 2 cards of his deck, trashes a revealed Treasure that you choose, discards the rest, and if anyone trashed a Treasure you take a Coin token, or, +1 Coin per Coin token you've taken with Pirate Ships this game.",
			"errata" : "Players revealing a card like Moat do so before you choose your option. If you choose the first option, you get +<1> per Coin token on your Pirate Ship mat; the Coin tokens stay there. If you choose the second option, each other player reveals the top 2 cards of their deck, trashes a revealed Treasure of your choice, if possible, and discards the rest of their revealed cards. Then, if any players did trash a Treasure, you add a Coin token to your Pirate Ship mat (from the supply of tokens). You get at most one Coin token per play of Pirate Ship. Take a Pirate Ship mat when you first need one. Coin tokens on your Pirate Ship mat cannot be spent (as the Coin tokens from Dominion: Guilds can be)."
		},
		{
			"name" : "Salvager",
			"setId" : 4,
			"isAction" : true,
			"cost" : 4,
			"buys" : 1,
			"description" : "Trash a card from your hand. + Coin equal to its cost.",
			"errata" : "For example if you trash an Estate, which costs <2>, you get +<2> (and +1 Buy). If you trash a card with <p> or <d> in the cost (from other expansions), you get nothing for those symbols."
		},
		{
			"name" : "Sea Hag",
			"setId" : 4,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 4,
			"description" : "Each other player discards the top card of his deck, then gains a Curse card, putting it on top of his deck.",
			"errata" : "The Curses are given out in turn order, which can matter when the Curse pile is low. They go onto decks rather than into discard piles."
		},
		{
			"name" : "Smugglers",
			"setId" : 4,
			"isAction" : true,
			"cost" : 3,
			"description" : "Gain a copy of a card costing up to 6 coins that the player to your right gained on his last turn.",
			"errata" : "The card has to cost <6> or less when you play Smugglers; it does not have to have cost <6> or less when the player to your right gained it. This looks at the most recent turn of the player to your right, even if you have taken multiple turns in a row. The gained card does not have to have been bought by the other player, just gained; for example you can gain a copy of a card they gained with their own Smugglers. If they gained multiple cards costing <6> or less, you choose between them; if they gained no such cards, you do not gain anything. This can only gain cards that are present in the Supply; for example you cannot gain a Spoils (from Dominion: Dark Ages). This is not an Attack, so Lighthouse and Moat do not stop it."
		},
		{
			"name" : "Tactician",
			"setId" : 4,
			"isAction" : true,
			"isDuration" : true,
			"cost" : 5,
			"description" : "Discard your hand. If you discarded any cards this way, then at the start of your next turn, +5 cards, +1 Buy, and +1 Action.",
			"errata" : "If you have no cards in hand, then Tactician does nothing more and is discarded in the same turn's Clean-up. If you do have at least one card, you discard your hand, Tactician stays in play, and at the start of your next turn you get +5 Cards, +1 Buy, and +1 Action (and Tactician is discarded that turn). If you use Throne Room on Tactician, you will discard your hand on the first play and will have no cards in hand for the second play (and so will not get the bonuses from it)."
		},
		{
			"name" : "Treasure Map",
			"setId" : 4,
			"isAction" : true,
			"cost" : 4,
			"description" : "Trash this and another copy of Treasure Map from your hand. If you do trash two Treasure Maps, gain 4 Gold cards, putting them on top of your deck.",
			"errata" : "When you play this, you trash it and trash another Treasure Map from your hand, if you can. If you did trash another copy of Treasure Map, then you gain 4 Golds, putting them onto your deck instead of your discard pile. If you did not have another copy of Treasure Map in hand, then you just trash the one Treasure Map and nothing else happens. If you Throne Room a Treasure Map, you will only trash the first Treasure Map once, and will gain no Golds."
		},
		{
			"name" : "Treasury",
			"setId" : 4,
			"isAction" : true,
			"cost" : 5,
			"cards" : 1,
			"actions" : 1,
			"coins" : 1,
			"description" : "When you discard this from play, if you didn't buy a Victory card this turn, you may put this on top of your deck.",
			"errata" : "If you did not buy any Victory cards during your turn, you may put any or all of your played Treasuries on top of your deck during Clean-up. If you did buy at least one Victory card, all of the Treasuries are discarded normally. Gaining a Victory card without buying it, such as with Smugglers, does not prevent you from putting Treasuries on your deck."
		},
		{
			"name" : "Warehouse",
			"setId" : 4,
			"isAction" : true,
			"cost" : 3,
			"cards" : 3,
			"actions" : 1,
			"description" : "Discard 3 cards.",
			"errata" : "If there are fewer than 3 cards for you to draw (after shuffling), you still discard 3 cards."
		},
		{
			"name" : "Wharf",
			"setId" : 4,
			"isAction" : true,
			"isDuration" : true,
			"cost" : 5,
			"cards" : 2,
			"buys" : 1,
			"description" : "Now and at the start of your next turn: +2 cards, +1 Buy.",
			"errata" : "You draw 2 cards and get +1 Buy when you play this, and draw another 2 Cards and get +1 Buy at the start of your next turn."
		},
		{
			"name" : "Alchemist",
			"setId" : 5,
			"isAction" : true,
			"cost" : 3,
			"potion" : true,
			"cards" : 2,
			"actions" : 1,
			"description" : "When you discard this from play, you may put this on top of your deck if you have a potion in play.",
			"errata" : "When you play this, you draw two cards and may play an additional Action card this turn. In the Clean-up Phase, when you discard this, if you have at least one Potion card in play, you may put Alchemist on top of your deck. This is optional and happens before drawing your new hand. If you have no cards in your deck when you do this, Alchemist becomes the only card in your deck. If you have multiple Alchemists and a Potion, you can put any or all of the Alchemists on top of your deck. You don't have to have used the Potion to buy anything, you only need to have played it."
		},
		{
			"name" : "Apothecary",
			"setId" : 5,
			"isAction" : true,
			"cost" : 2,
			"potion" : true,
			"cards" : 1,
			"actions" : 1,
			"description" : "Reveal the top 4 cards of your deck. Put the revealed Coppers and potions into your hand. Put the other cards back on top of your deck in any order.",
			"errata" : "You draw a card first. Then reveal the top four cards, put the Coppers and Potions into your hand, and put the rest back on top of your deck. If there aren't four cards left in your deck, reveal what you can and shuffle to get the rest. If there still aren't enough cards, just reveal what there is. Any cards that are not Copper and are not Potion go back on top of your deck in an order you choose. You cannot choose not to take all of the Coppers and Potions. If after revealing four cards there are no cards left in your deck, the cards you put back will become the only cards in your deck."
		},
		{
			"name" : "Apprentice",
			"setId" : 5,
			"isAction" : true,
			"cost" : 5,
			"actions" : 1,
			"description" : "Trash a card from your hand. +1 Card per Coin it costs. +2 cards if it has <potion> in its cost.",
			"errata" : "If you do not have any cards left in hand to trash, you do not draw any cards. If you trash a card costing <0>, such as Curse or Copper, you do not draw any cards. Otherwise you draw a card per <1> the card you trashed cost, and another two cards if it had <p> in its cost. For example, if you trash a Golem, which costs <4><p>, you draw 6 cards."
		},
		{
			"name" : "Familiar",
			"setId" : 5,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 3,
			"potion" : true,
			"cards" : 1,
			"actions" : 1,
			"description" : "Each other player gains a Curse.",
			"errata" : "If there aren't enough Curses left to go around when you play Familiar, you deal them out in turn order, starting with the player to your left. If you play Familiar with no Curses remaining, you will still get +1 Card and +1 Action. A player gaining a Curse puts it face-up into his Discard pile."
		},
		{
			"name" : "Golem",
			"setId" : 5,
			"isAction" : true,
			"cost" : 4,
			"potion" : true,
			"description" : "Reveal cards from your deck until you reveal 2 Action cards other than Golem cards. Discard the other cards, then play the Action cards in either order.",
			"errata" : "Reveal cards from the top of your deck, one at a time, until you have revealed two Action cards that are not Golem. If you run out of cards before revealing two non-Golem Actions, shuffle your discard pile (but not the revealed cards) and continue. If you run out and have no discard pile left either, you just get the Actions you found. Discard all of the revealed cards except for the non-Golem Actions you found. If you did not find any, you're done. If you found one, play it. If you found two, play them both, in either order. You cannot choose not to play one of them. These Action cards are not in your hand and so are unaffected by things that look for cards in your hand. For example, if one of them is Throne Room (from Dominion), you cannot use it on the other one."
		},
		{
			"name" : "Herbalist",
			"setId" : 5,
			"isAction" : true,
			"cost" : 2,
			"coins" : 1,
			"buys" : 1,
			"description" : "When you discard this from play, you may put one of your Treasures from play on top of your deck.",
			"errata" : "When you play this, you get an extra coin to spend this turn, and may buy an additional card in your Buy phase. When you discard this from play (usually during Clean-up), you may choose a Treasure card you have in play, and put that card on your deck. If you have no cards in your deck, that Treasure will become the only card in your deck. You choose what order to discard cards during Clean-up; so, for example, if you have Herbalist, Potion, and Alchemist in play, you could choose to discard Alchemist first, putting it on top of your deck, then discard Herbalist, and put Potion on top of your deck. If you have multiple Herbalists in play, each one will let you put another Treasure from play onto your deck when you discard it."
		},
		{
			"name" : "Philosopher's Stone",
			"setId" : 5,
			"isTreasure" : true,
			"cost" : 3,
			"potion" : true,
			"description" : "When you play this, count your deck and discard pile. Worth 1 Coin per 5 cards total between them (rounded down).",
			"errata" : "This is a Treasure card. It is a Kingdom card; it will only be in games where it is randomly dealt out as one of the 10 Kingdom cards, or otherwise selected to be one of them. It is played during your Buy phase, like other Treasure cards. When you play it, count the number of cards in your deck and discard pile combined, divide by 5, and round down. That is how many coins this produces for you. Once played, the amount of coins you get does not change even if the number of cards changes later in the turn. The next time you play it, count again. If you play multiple copies, obviously the number will be the same for all of them. It does not matter what order your discard pile is in, but the order your deck is in matters. Do not change that order while counting! You will get to look through your discard pile as you count it. You only count your deck and discard pile, not your hand or cards in play or set aside cards. You cannot play more Treasures after buying something in your buy phase; so for example you cannot buy a card, then play Philosopher's Stone, then buy another card."
		},
		{
			"name" : "Possession",
			"setId" : 5,
			"isAction" : true,
			"cost" : 6,
			"potion" : true,
			"description" : "The player to your left takes an extra turn after this one, in which you can see all cards he can and make all decisions for him. Any cards he would gain on that turn, you gain instead, any cards of his that are trashed are set aside and returned to his deck.",
			"errata" : "You are not taking a turn with the deck of the player to your left; that player is taking a turn, with you making the decisions and gaining the cards. This is a crucial difference to keep in mind when considering card interactions – the \"you\" in all cards still refers to the player being Possessed, not the player doing the Possessing. Possession has several pieces to it: - You can see the Possessed player's cards for the entire turn, which means you will see his next hand during Clean-up. You will also see any cards he is entitled to see due to card rules; for example, you can look at cards he has set aside with Native Village (from Seaside). You can count any cards he can count. - You make all decisions for the Possessed player, including what cards to play, decisions those cards provide, and what cards to buy. - Any cards the Possessed player would have gained in any way, you gain instead; this includes cards bought, as well as cards gained due to Actions. The cards you gain this way go to your discard pile, even if they would have gone to that player's hand or the top of his deck or somewhere else. You only gain cards he would have; you do not gain tokens he would have (for example from the Dominion: Seaside card Pirate Ship)."
		},
		{
			"name" : "Scrying Pool",
			"setId" : 5,
			"isAction" : true,
			"cost" : 2,
			"potion" : true,
			"actions" : 1,
			"description" : "Each player (including you) reveals the top card of his deck and either discards it or puts it back, your choice. Then reveal cards from the top of your deck until revealing one that isn't an Action. Put all of your revealed cards into your hand.",
			"errata" : "First you reveal the top card of each player's deck, and either have them discard it or have them put it back. If people care about the order, go clockwise, starting with yourself. You make a separate decision for each player. After you finish making those decisions, reveal cards from the top of your deck until you reveal a card that isn't an Action card. If you run out of cards without revealing a non-Action card, shuffle your discard pile and keep going. If you have no discard pile left either, stop there. Put all of the revealed Action cards into your hand, plus that first non-Action you revealed. If the very first card you revealed was not an Action, that card goes into your hand. Cards with multiple types, one of which is Action, are Actions. The only cards that go into your hand are the ones revealed as part of revealing cards until finding a non-Action; you do not get discarded cards from the first part of what Scrying Pool did, or cards from other players' decks."
		},
		{
			"name" : "Transmute",
			"setId" : 5,
			"isAction" : true,
			"cost" : 0,
			"potion" : true,
			"description" : "Trash a card from your hand. If it is an Action card, gain a Duchy. Treasure card, gain a Transmute. Victory card, gain a Gold.",
			"errata" : "If you have no cards left in hand to trash, you do not get anything. If you trash a Curse to this, you do not get anything – Curse is not an Action card or Victory card or Treasure card. If you trash a card with more than one type, you get each applicable thing. For example, if you trash an Action-Victory card (such as Nobles, from Dominion: Intrigue), you gain both a Duchy and a Gold. Gained cards come from the Supply and go to your discard pile. If there are no appropriate cards left to gain, you don't gain those cards."
		},
		{
			"name" : "University",
			"setId" : 5,
			"isAction" : true,
			"cost" : 2,
			"potion" : true,
			"actions" : 2,
			"description" : "You may gain an Action card costing up to 5 coins.",
			"errata" : "Gaining an Action card is optional. If you choose to gain one, it comes from the Supply, must cost no more than <5>, and goes to your discard pile. Cards with multiple types, one of which is Action, are Actions and can be gained this way. Cards with <p> in their cost can't be gained by this."
		},
		{
			"name" : "Vineyard",
			"setId" : 5,
			"isVictory" : true,
			"cost" : 1,
			"potion" : true,
			"description" : "Worth 1 VP for every 3 Action cards in your deck (rounded down).",
			"errata" : "This Kingdom card is a Victory card, not an Action card. It does nothing until the end of the game, when it is worth 1 victory point per 3 Action cards in your Deck (counting all of your cards - your Discard pile and hand are part of your Deck at that point). Round down; if you have 11 Action cards, Vineyard is worth 3 victory points. During set-up, put all 12 Vineyards in the Supply for a game with 3 or more players, but only 8 in the Supply for a 2-player game. Cards with multiple types, one of which is Action, are Actions and so are counted by Vineyard."
		},
		{
			"name" : "Bank",
			"setId" : 6,
			"isTreasure" : true,
			"cost" : 7,
			"description" : "When you play this, it's worth 1 Coin per Treasure card you have in play (counting this).",
			"errata" : "When you play Bank, it is worth <1> per Treasure you have in play, counting itself. If you play two copies of Bank in a row, the second one will be worth <1> more than the first one. Playing more Treasures after Bank will not change how much <> you got from it."
		},
		{
			"name" : "Bishop",
			"setId" : 6,
			"isAction" : true,
			"cost" : 4,
			"description" : "",
			"errata" : "Trashing a card is optional for the other players but mandatory for you. If players care about the order things happen for this, you trash a card first, then each other player may trash a card, in turn order. Only the player who played Bishop can get <v> tokens from it. <p> and <d> in costs is ignored; for example if you trash Golem (from Dominion: Alchemy), which costs <4><p>, you get 3<v> total. If you have no cards left in hand to trash, you still get the <1> and 1<v>."
		},
		{
			"name" : "City",
			"setId" : 6,
			"isAction" : true,
			"cost" : 5,
			"cards" : 1,
			"actions" : 2,
			"description" : "If there are one or more empty Supply piles, +1 Card. If there are two or more, +1 Coin and +1 Buy.",
			"errata" : "You draw a card and get +2 Actions no matter what. If there is just one empty pile in the Supply, you also draw another card. If there are two or more empty piles, you both draw another card, and get +<1> and +1 Buy. There are no further bonuses if three or more piles are empty. This only checks how many piles are empty when play it; what you got does not change if a pile becomes empty (or non-empty, such as due to Ambassador from Dominion: Seaside). This only counts Supply piles, not non-Supply piles like Spoils from Dark Ages."
		},
		{
			"name" : "Contraband",
			"setId" : 6,
			"isTreasure" : true,
			"cost" : 5,
			"coins" : 3,
			"buys" : 1,
			"description" : "When you play this, the player to your left names a card. You can't buy that card this turn.",
			"errata" : "When you play this, you get <3> and +1 Buy. The player to your left names a card, and you cannot buy the named card this turn. This does not stop you from gaining the card in ways other than buying it (such as via Hoard). They do not have to name a card in the Supply. If you play multiple Contrabands in one turn, the player to your left names a card each time; if they name different cards, you cannot buy any of the named cards this turn. If you play Contraband before other Treasures, you hide how much <> you will have; however the number of cards left in a player's hand is public information.'"
		},
		{
			"name" : "Counting House",
			"setId" : 6,
			"isAction" : true,
			"cost" : 5,
			"description" : "Look through your discard pile, reveal any number of Copper cards from it, and put them into your hand.",
			"errata" : "This card lets you look through your discard pile, something you normally are not allowed to do. You only get to look through your discard pile when you play this. You do not have to show the other players your entire discard pile, just the Coppers you take out. After you take out the Coppers, you can leave your discard pile in any order."
		},
		{
			"name" : "Expand",
			"setId" : 6,
			"isAction" : true,
			"cost" : 7,
			"description" : "Trash a card from your hand. Gain a card costing up to 3 coins more than the trashed card.",
			"errata" : "If you do not have a card to trash, you do not gain one. If you do gain a card, it comes from the Supply and is put into your discard pile. The gained card does not need to cost exactly <3> more than the trashed card; it can cost that much or less, and can even be another copy of the trashed card."
		},
		{
			"name" : "Forge",
			"setId" : 6,
			"isAction" : true,
			"cost" : 7,
			"description" : "Trash any number of cards from your hand. Gain a card with cost exactly equal to the total cost in coins of the trashed cards.",
			"errata" : "\"Any number\" includes zero. If you trash no cards, you have to gain a card costing <0> if you can. If there is no card at the required cost, you do not gain a card. The card you gain comes from the Supply and is put into your discard pile. <p> (on cards in Dominion: Alchemy) and <d> (on cards in Dominion: Empires) are not added, and the card you gain cannot have those symbols in its cost."
		},
		{
			"name" : "Goons",
			"setId" : 6,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 6,
			"coins" : 2,
			"buys" : 1,
			"description" : "Each other player discards down to 3 cards in hand. While this is in play, when you buy a card, +1 VP.",
			"errata" : "You get +1<v> per card you buy, but do not get +1<v> for gaining a card some other way. Multiple copies of Goons are cumulative; if you have two Goons in play and buy a Silver, you'll get +2<v>. However if you King's Court a Goons, despite having played the card 3 times, there is still only one copy of it in play, so buying Silver would only get you +1<v>."
		},
		{
			"name" : "Grand Market",
			"setId" : 6,
			"isAction" : true,
			"cost" : 6,
			"cards" : 1,
			"actions" : 1,
			"coins" : 2,
			"buys" : 1,
			"description" : "You can't buy this if you have any Copper in play.",
			"errata" : "A single Copper in play is enough to stop you from buying Grand Market. You do not have to play all of the Treasures in your hand. Coppers in your hand do not stop you from buying Grand Market - only Coppers in play do. Coppers that were in play earlier in the turn but aren't anymore also do not stop you; if you have 11 Coppers in play and 2 Buys, you could buy a Mint, trash all of your played Treasures, and then buy a Grand Market. You can gain Grand Market in other ways - for Exmaple with Expand - whether or not you have Coppers in play. Treasures other than Copper do not prevent you from buying Grand Market, even if they are worth <1> (such as Loan). Remember you cannot play more Trasures after buying a card."
		},
		{
			"name" : "Hoard",
			"setId" : 6,
			"isTreasure" : true,
			"cost" : 6,
			"coins" : 2,
			"description" : "While this is in play, when you buy a Victory card, gain a Gold.",
			"errata" : "When you buy a Victory card with this in play, you gain a Gold card from the Supply, putting it into your discard pile. If there are no Golds left, you do not get one. If you have multiple Hoards in play, you will gain multiple Golds from buying a single Victory card. If you buy multiple Victory cards, you will get Gold for each one. So for example if you had two Hoards in play and no other money, with +1 Buy, you could buy two Estates and gain four Golds. Victory cards gained other than via buying them do not get you Gold."
		},
		{
			"name" : "King's Court",
			"setId" : 6,
			"isAction" : true,
			"cost" : 7,
			"description" : "You may choose an Action card in your hand. Play it three times.",
			"errata" : "This is similar to Throne Room, but plays the Action card three times rather than twice. Playing an Action card from your hand is optional. If you do play one, you resolve it completely, then play it a second time, then play it a third time. You cannot play other cards in-between (unless told to by the card, such as with King's Court itself). Playing Action cards with King's Court is just like playing Action cards normally, except it does not use up Action plays for the turn. For example if you start a turn by playing King's Court on Village, you would craw a card, and get +2 Actions, draw another card, get +2 Actions again, draw a 3rd card, and get +2 Actions again, leaving you with 6 Actions. If you King's Court a King's Court, you may play an Action card three times, then may play another Action card three times, then may play a 3rd Action card three times; you do not play one Action card nine times."
		},
		{
			"name" : "Loan",
			"setId" : 6,
			"isTreasure" : true,
			"cost" : 3,
			"coins" : 1,
			"description" : "When you play this, reveal cards from your deck until you reveal a Treasure. Discard it or trash it. Discard the other cards.",
			"errata" : ""
		},
		{
			"name" : "Mint",
			"setId" : 6,
			"isAction" : true,
			"cost" : 5,
			"description" : "You may reveal a Treasure card from your hand. Gain a copy of it. then you buy this, trash all Treasures you have in play.",
			"errata" : "When you buy this, you trash all of your Treasure cards in play (but not ones in your hand or elsewhere). If you buy multiple cards in a turn, trash your Treasures right when you buy Mint; you still have any leftover <> they produced for spending on something else. Remember you do not have to play all of the Treasures from your hand each turn (just all the ones you want producing money for you), and you cannot play more Treasures after buying a card. When you play this, you may reveal a Treasure card from your hand and gain a copy of it from the Supply, putting the gained card into your discard pile. The revealed card stays in your hand. If you buy a Mint and use Watchtower to put it on top of your deck or trash it, you will still trash all of your Treasures from play. However if you buy a Mint with Royal Seal in play, the Royal Seal will be gone before you can use it to put Mint on your deck."
		},
		{
			"name" : "Monument",
			"setId" : 6,
			"isAction" : true,
			"cost" : 4,
			"coins" : 2,
			"victoryPoints" : 1,
			"description" : "",
			"errata" : "You get +<2> and take a <v> token."
		},
		{
			"name" : "Mountebank",
			"setId" : 6,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 5,
			"coins" : 2,
			"description" : "Each other player may discard a Curse. If he doesn't, he gains a Curse and a Copper.",
			"errata" : "This hits the other players in turn order, which can matter when the Curse or Copper piles are low. Each of the other players in turn chooses whether or not to discard a Curse card, and the players who do not gain a Curse and a Copper from the Supply, putting them into their discard piles. If either the Curse or Copper pile is empty, players still gain the other card."
		},
		{
			"name" : "Peddler",
			"setId" : 6,
			"isAction" : true,
			"cost" : 8,
			"cards" : 1,
			"actions" : 1,
			"coins" : 1,
			"description" : "During your Buy phase, this costs 2 coins less per Action card you have in play, but not less than 0 Coin.",
			"errata" : "Most of the time, this costs <8>. During your Buy phase, this costs <2> less per Action card you have in play. This applies to all Peddler cards, including ones in hands and decks. It never costs less than <0>. If you play King's Court on Worker's Village, for example, that's just two Action cards you have in play, even though you played the Worker's Village three times. Buying cards using the promotional card Black Market is something that does not happen during a Buy phase, so Peddler still costs <8> then."
		},
		{
			"name" : "Quarry",
			"setId" : 6,
			"isTreasure" : true,
			"cost" : 4,
			"coins" : 1,
			"description" : "While this is in play, Action cards cost 2 coins less, but not less than 0 Coin.",
			"errata" : "While Quarry is in play, Action cards cost <2> less, to a minimum of <0>. This is cumulative; if you play two Quarries during your Buy phase, then King's Court will only cost <3>, rather than the usual <7>. It is also cummulative with other effects that modify costs; if you play Worker's Village in your Action phase, then two Quarries in your Buy phase, Peddler will cost <2>. It affects cards everywhere, such as cards in players' hands."
		},
		{
			"name" : "Rabble",
			"setId" : 6,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 5,
			"cards" : 3,
			"description" : "Each other player reveals the top 3 cards of his deck, discards the revealed actions and Treasures, and puts the rest back on top in any order he chooses.",
			"errata" : "The other players shuffle if necessary to get 3 cards to reveal, and just reveal what they can if they still have fewer than 3 cards. They discard revealed Treasures and Actions and put the rest back on top in whatever order they want."
		},
		{
			"name" : "Royal Seal",
			"setId" : 6,
			"isTreasure" : true,
			"cost" : 5,
			"coins" : 2,
			"description" : "While this is in play, when you gain a card, you may put that card on top of your deck.",
			"errata" : "If you gain multiple cards with this in play, this applies to each of them - you could put any or all of them on top of your deck. This applies both to cards gained due to being bought, and to cards gained other ways with Royal Seal in play, such as with Hoard."
		},
		{
			"name" : "Talisman",
			"setId" : 6,
			"isTreasure" : true,
			"cost" : 4,
			"coins" : 1,
			"description" : "While this is in play, when you buy a card costing 4 coins or less that is not a Victory card, gain a copy of it.",
			"errata" : "Each time you buy a non-Victory card costing <4> or less with this in play, you gain another copy of the bought card. If there are no copies left, you do not gain one. The gained card comes from the Supply and goes into your discard pile. If you have multiple Talismans, you gain an additional copy for each one; if you buy multiple cards for <4> or less, Talisman applies to each one. For example if you have two Talismans, four Coppers, and two Buys, you could buy Silver and Trade Route, gaining two more Silvers and two more Trade Routes. Talisman only affects buying cards; it does not work on cards gained other ways, such as with Expand. Talisman only cares about the cost of the card when you buy it, not its normal cost; so for example it can get you a Peddler if you have played two Actions this turn, thus lowering Peddler's cost to 4, or can get you a Grand Market if you have a Quarry in play."
		},
		{
			"name" : "Trade Route",
			"setId" : 6,
			"isAction" : true,
			"cost" : 3,
			"buys" : 1,
			"description" : "+1 Coin per token on the Trade Route mat. Trash a card from your hand. [Setup]: Put a token on each Victory card Supply pile. When a card is gained from that pile, move the token to the Trade Route mat.",
			"errata" : "You get +1 Buy, and trash a card from your hand if you can. Then you get +<1> per Coin token on the Trade Route mat. This card has setup; at the start of games using it, you put a Coin token on each Victory card pil being used (including Kingdom card piles such as Gardens, and Colonies if used). In the rare cases where there are more than 8 Victory piles, the tokens are not counter-limited; use a replacement. Whenever any player gains a card from a Victory card pile - whether by buyng it or otherwise gaining it - the Coin token is moved to the mat. So if no Victory cards have been gained this game, the mat has no tokens and Trade Route makes +<0>; if four Provinces and one Estate have been gained, the mat has two tokens and Trade Route makes +<2>. If you are using the promotional card Black Market, and Trade Route is in the Black Market deck, you do the setup for Trade Route."
		},
		{
			"name" : "Vault",
			"setId" : 6,
			"isAction" : true,
			"cost" : 5,
			"cards" : 2,
			"description" : "Discard any number of cards. +1 Coin per card discarded. Each other player may discard 2 cards. If he does, he draws a card.",
			"errata" : "\"Any number\" includes zero. You draw 2 cards first; the cards you just drew can be among the cards you discard. Each other player chooses whether or not to discard 2 cards, then discards 2 cards if they choose to, then draws a card if they did discard 2 cards. A player with just one card can choose to discard it, but won't draw a card. A player who discards but then has no cards left to draw shuffles in the discards before drawing."
		},
		{
			"name" : "Venture",
			"setId" : 6,
			"isTreasure" : true,
			"cost" : 5,
			"coins" : 1,
			"description" : "When you play this, reveal cards from your deck until you reveal a Treasure. Discard the other cards. Play that Treasure.",
			"errata" : "When you play Venture, you reveal cards from your deck until revealing a Treasure card. If you run out of cards before revealing a Treasure, shuffle your discard pile (but not the revealed cards) to get more; if you still don't find a Treasure, just discard all of the revealed cards. If you do find a Treasure, discard the other cards and play the Treasure. If that Treasure does something when played, do that something. For example if Venture finds you another Venture, you reveal cards again."
		},
		{
			"name" : "Watchtower",
			"setId" : 6,
			"isAction" : true,
			"isReaction" : true,
			"cost" : 3,
			"description" : "[Action]: Draw until you have 6 cards in hand. [Reaction]: When you gain a card, you may reveal this from your hand. If you do, either trash that card, or put it on top of your deck.",
			"errata" : "When you play this, you draw cards one at a time until you have 6 cards in hand. If you have 6 or more cards in hand already, you don't draw any cards. When you gain a card, directly afterwards, you may reveal Watchtower from your hand, to either trash the gained card or put it on top of your deck (with Watchtower staying in your hand). You may reveal Watchtower whether you gained the card due to buying it, or gained it some other way, such as with Expand or Mountebank. You may reveal Watchtower each time you gain a card, and each gain is a separate decision; for example if another player plays Mountebank, you may reveal Watchtower to trash both the Copper and Curse, or just one, or trash one and put the other on your deck, and so on. Cards trashed with Watchtower were still gained; they were just immediately trashed afterwards. If a gained card is going somewhere other than to your discard pile, such as a card gained with Mine, you can still use Watchtower to trash it or put it on your deck."
		},
		{
			"name" : "Worker's Village",
			"setId" : 6,
			"isAction" : true,
			"cost" : 4,
			"cards" : 1,
			"actions" : 2,
			"buys" : 1,
			"description" : "",
			"errata" : "You draw a card and get +2 Actions and +1 Buy."
		},
		{
			"name" : "Bag of Gold",
			"setId" : 7,
			"isAction" : true,
			"cost" : 0,
			"actions" : 1,
			"excludeFromSupply" : true,
			"prize" : true,
			"description" : "Gain a Gold, putting it on top of your deck.",
			"errata" : "The Gold you gain comes from the Supply and is put on top of your deck. If your deck has no cards in it, it becomes the only card in your deck. If there are no Golds left in the Supply, you do not gain one. This is a Prize; see the Additional Rules."
		},
		{
			"name" : "Diadem",
			"setId" : 7,
			"cost" : 0,
			"cards" : 1,
			"coin" : 2,
			"treasure" : true,
			"excludeFromSupply" : true,
			"prize" : true,
			"description" : "When you play this, +<1> per unused Action you have (Action, not Action card).",
			"errata" : "This is a Treasure worth <2>, like Silver. You play it in your Buy phase, like other Treasures. When you play it, you get an extra +<1> per unused Action you have. This means Actions, not Action cards. So for example if you play Farming Village (which gives you +2 Actions), then Diadem, Diadem will give you an extra +<2>, for <4> total. If you play no Action cards at all on your turn, you will have one unused Action, so you will get <3> total from Diadem. This is a Prize; see the Additional Rules."
		},
		{
			"name" : "Fairgrounds",
			"setId" : 7,
			"isVictory" : true,
			"cost" : 6,
			"description" : "Worth 2 VP for every 5 differently named cards in your deck (rounded down).",
			"errata" : "At the end of the game, this is worth 2 <v> per 5 differently named cards in your deck, rounded down. So if you have 0-4 different cards, it is worth 0 <v>; if you have 5-9, it is worth 2 <v>; if you have 10-14, it is worth 4 <v>; if you have 15-19, it is worth 6 <v>; and so on. By default there are only 17 differently named cards available in a game, but sometimes there may be more cards, such as via Young Witch's setup rule, or due to Tournament. Use 8 Fairgrounds in a game with 2 players, and 12 for a game with 3 or more players."
		},
		{
			"name" : "Farming Village",
			"setId" : 7,
			"isAction" : true,
			"cost" : 4,
			"actions" : 2,
			"description" : "Reveal cards from the top of your deck until you reveal an Action or Treasure card. Put that card into your hand and discard the other cards.",
			"errata" : "Reveal cards from the top of your deck until you reveal a Treasure or Action card. If you run out of cards before finding one, shuffle your discard pile (but not the revealed cards), and keep revealing cards. If you still cannot find one, just discard all of the revealed cards. If you do find a Treasure or Action card, put it into your hand, and discard the rest of the revealed cards. A card with multiple types, one of which is Treasure or Action (for example Diadem, a Treasure - Prize), is a Treasure or Action and so will be drawn by this. You do not choose Treasure or Action - you stop on the first card matching either type."
		},
		{
			"name" : "Followers",
			"setId" : 7,
			"isAction" : true,
			"cost" : 0,
			"cards" : 2,
			"excludeFromSupply" : true,
			"prize" : true,
			"description" : "Gain an Estate. Each other player gains a Curse and discards down to 3 cards in hand.",
			"errata" : "Do the things in the order listed. You draw 2 cards; then you gain an Estate from the Supply, putting it into your discard pile; then each other player gains a Curse from the Supply, putting it into his discard pile; then each other player discards down to 3 cards in hand. A player with 3 or fewer cards in hand does not discard any cards. If there are no Estates left, you do not gain one. If there are not enough Curses left, deal out the remaining Curses in turn order. This is a Prize; see the Additional Rules."
		},
		{
			"name" : "Fortune Teller",
			"setId" : 7,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 3,
			"cards" : 2,
			"description" : "Each other player reveals cards from the top of his deck until he reveals a Victory or Curse card. He puts it on top and discards  the other revealed cards.",
			"errata" : "Each other player reveals cards from the top of his deck until he reveals a Victory or Curse card. If he runs out of cards before finding one, he shuffles his discard pile (but not the revealed cards), and keeps revealing cards. If he still cannot find one, he just discards all of the revealed cards. If he does find one, he puts the Victory or Curse card on top of his deck, and discards the other revealed cards. If his deck has no other cards in it, it becomes the only card in his deck. A card with multiple types, one of which is Victory (such as Nobles from Dominion: Intrigue), is a Victory card. You do not choose Victory or Curse - they stop on the first card that matches either type."
		},
		{
			"name" : "Hamlet",
			"setId" : 7,
			"isAction" : true,
			"cost" : 2,
			"cards" : 1,
			"actions" : 1,
			"description" : "You may discard a card, if you do +1 Action. You may discard a card, if you do +1 Buy.",
			"errata" : "First draw a card, and get +1 Action. Then you may either discard one card to get another +1 Action; or you may discard one card to get +1 Buy; or you may discard two cards and get both +1 Action and +1 Buy; or you may discard no cards at all. You only get the extra +1 Action or +1 Buy if you actually discarded a card for it. You cannot discard multiple cards to get multiple +Actions or multiple +Buys."
		},
		{
			"name" : "Harvest",
			"setId" : 7,
			"isAction" : true,
			"cost" : 5,
			"description" : "Reveal the top 4 cards of your deck, then discard them. +1 Coin per differently named card revealed.",
			"errata" : "Reveal the top 4 cards of your deck. If there are not enough cards, reveal what you can, shuffle your discard pile, and reveal the rest. If there still are not 4 cards total to reveal, just reveal what you can. You discard the revealed cards, and get +<1> per differently named card revealed. For example if you revealed Copper, Silver, Copper, Estate, that would be +<3>."
		},
		{
			"name" : "Horn of Plenty",
			"setId" : 7,
			"isTreasure" : true,
			"cost" : 5,
			"description" : "When you play this, gain a card costing up to 1 Coin per differently named card you have in play, counting this. If it's a Victory card, trash this.",
			"errata" : "This is a Treasure worth <0>. You play it in your Buy phase, like other Treasures. It does not produce any coins to spend. However, when you play it, you gain a card costing up to <1> per differently named card you have in play. This includes itself, other played Treasures, played Actions, and any Duration cards (from Dominion: Seaside) played on your previous turn. It only counts cards currently in play, not ones that were in play but left; for example if you played a Feast (from Dominion) this turn, you will have trashed it, so it will not count for Horn of Plenty. The card you gain must come from the Supply, and is put into your discard pile. If it is a Victory card, trash Horn of Plenty. Cards with multiple types, one of which is Victory (such as Nobles from Dominion: Intrigue) are Victory cards. You do not have to play Horn of Plenty in your Buy phase, and you choose the order that you play Treasures. You do not trash Horn of Plenty if you gain a Victory card some other way while it's in play (such as by buying one)."
		},
		{
			"name" : "Horse Traders",
			"setId" : 7,
			"isAction" : true,
			"isReaction" : true,
			"cost" : 4,
			"buys" : 1,
			"coins" : 3,
			"description" : "[Action]: Discard 2 cards. [Reaction]: When another player plays an Attack card, you may set this aside from your hand. If you do, then at the start of your next turn, +1 Card and return this to your hand.",
			"errata" : "When you play this, you get +1 Buy and +<3>, and discard 2 cards from your hand. If you do not have enough cards to discard, just discard what you can; you still get the +1 Buy and +<3>. When another player plays an Attack card, before that card does anything, you may reveal this from your hand. If you do, you set it aside, and at the start of your next turn, you return it to your hand and draw a card. While it is set aside, it is not in play or in your hand, and cannot be further revealed to Attacks. Therefore it will only work on one Attack per round of turns. You can reveal it for an Attack and still play it on your next turn. You can reveal multiple Horse Traders to a single Attack. For example, if another player plays Followers, you could reveal and set aside two Horse Traders from your hand, then gain a Curse but discard no cards, as you would only have three cards in hand at that point. Then on your next turn you would pick up the two Horse Traders and also draw two cards."
		},
		{
			"name" : "Hunting Party",
			"setId" : 7,
			"isAction" : true,
			"cost" : 5,
			"cards" : 1,
			"actions" : 1,
			"description" : "Reveal your hand. Reveal cards from your deck until you reveal a card that isn't a duplicate of one in your hand. Put it into your hand and discard the rest.",
			"errata" : "First you draw a card and get +1 Action. Then you reveal your hand, and reveal cards from your deck until revealing one that is not a duplicate of one in your hand. A card is not a duplicate of one in your hand if it does not have the same name as any cards in your hand. If you run out of cards while revealing cards, shuffle your discard pile (but not the revealed cards) and keep revealing cards. If you still do not find one, just discard all of the cards revealed from your deck. If you do find a card not matching any cards in your hand, put it into your hand and discard the other cards revealed from your deck."
		},
		{
			"name" : "Jester",
			"setId" : 7,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 5,
			"coins" : 2,
			"description" : "Each other player discards the top card of his deck. If it's a Victory card he gains a Curse. Otherwise he gains a copy of the discarded card or you do, your choice.",
			"errata" : "Each player with no cards in his deck shuffles his discard pile in order to get a card to discard. If he still has no cards, he does not discard one. For each player who discarded a card, if it is a Victory card, he gains a Curse, and otherwise, you choose: either that player gains a copy of the card, or you do. The gained copies and Curses come from the Supply and are put into the discard piles of the players who gain them. If a card is revealed for which there are no copies in the Supply, no one gains a copy of it. This Attack hits other players in turn order, which can matter when some piles are low. A card with multiple types, one of which is Victory (such as Nobles from Dominion: Intrigue) is a Victory card."
		},
		{
			"name" : "Menagerie",
			"setId" : 7,
			"isAction" : true,
			"cost" : 3,
			"actions" : 1,
			"description" : "Reveal your hand. If there are no duplicate cards in it, +3 cards. Otherwise, +1 Card.",
			"errata" : "If there are any two or more cards in your hand with the same name, you only draw one card; if there are no matches, you draw three cards. Only the card names matter for this; Copper and Silver are different cards for example, despite both being Treasures. If you have no cards in hand at all after playing Menagerie, then you have no matching cards, and so get +3 Cards."
		},
		{
			"name" : "Princess",
			"setId" : 7,
			"isAction" : true,
			"cost" : 0,
			"buy" : 1,
			"excludeFromSupply" : true,
			"prize" : true,
			"description" : "When this is in play, cards cost <2> less, but not less than <0>.",
			"errata" : "This makes all cards cheaper (to a minimum of <0>) as long as it is in play. When it leaves play, it stops making cards cheaper. This applies to cards everywhere - cards in the Supply, cards in hand, cards in decks. For example if you played Princess, then Remake, trashing a Copper, you could gain a Silver, as Silver would cost <1> while Copper would still cost <0>. Using Throne Room (from Dominion) on Princess will not make cards cost <4> less, as there is still only one copy of Princess in play. This is a Prize; see the Additional Rules."
		},
		{
			"name" : "Remake",
			"setId" : 7,
			"isAction" : true,
			"cost" : 4,
			"description" : "Do this twice: Trash a card from your hand then gain a card costing exactly 1 Coin more than the trashed card.",
			"errata" : "Trash a card from your hand, and gain a card costing exactly <1> more than it; then trash another card from your hand, and gain a card costing exactly <1> more than that card. If you have no cards in hand, you do not trash anything or gain anything; if you have only one card in hand, trash it and gain a card costing <1> more than it. Gained cards come from the Supply and are put into your discard pile. If there is no card at the exact cost needed, you do not gain a card for that trashed card. For example you could use Remake to trash an Estate, gaining a Silver, then trash a Copper, gaining nothing."
		},
		{
			"name" : "Tournament",
			"setId" : 7,
			"isAction" : true,
			"cost" : 4,
			"actions" : 1,
			"description" : "Each player may reveal a Provence from his hand. If you do, discard it and gain a Prize (from the Prize pile) or a Duchy, putting it on top of your deck. If no one else does, +1 Card, +1 Coin.",
			"errata" : "First you get +1 Action. Then each player, including you, may reveal a Province card from his hand. Then, if you revealed a Province, discard that card, and you gain a Prize of your choice, or a Duchy, putting whatever card you took on top of your deck. If there were no cards in your deck, it becomes the only card in your deck. There are five Prizes, set out at the start of the game; see Preparation. You can only take a Prize from the Prize pile. You can take any Prize from the Prize pile; you do not have to take the top one. You can take a Duchy instead, whether or not the Prizes have run out. You can opt to take a Duchy even if the Duchy pile is empty, or a Prize even if no Prizes are left; in these cases you gain nothing. After gaining your card or not, if no other player revealed a Province, you draw a card and get +<1>. So this card will play out one of four ways:1) if you do not reveal a Province and no-one else does either, you will get +1 Action +1 Card +<1>;2) if you reveal a Province and no one else does, you will gain a Prize or a Duchy and draw it, as well as get +1 Action +<1>;3) if you reveal a Province and so does someone else, you will get +1 Action and gain a Prize or a Duchy, which will be on top of your deck; 4) if you do not reveal a Province but someone else does, you will just get +1 Action. When you gain a Prize, take whichever remaining Prize you want. You can look through the Prizes that players have not gained yet whenever you want."
		},
		{
			"name" : "Trusty Steed",
			"setId" : 7,
			"isAction" : true,
			"cost" : 0,
			"excludeFromSupply" : true,
			"prize" : true,
			"description" : "Choose two: +2 Cards; +2 Actions; +<2>; gain 4 Silvers and put your deck into your discard pile. (The choices must be different.)",
			"errata" : "This makes all cards cheaper (to a minimum of <0>) as long as it is in play. When it leaves play, it stops making cards cheaper. This applies to cards everywhere - cards in the Supply, cards in hand, cards in decks. For example if you played Princess, then Remake, trashing a Copper, you could gain a Silver, as Silver would cost <1> while Copper would still cost <0>. Using Throne Room (from Dominion) on Princess will not make cards cost <4> less, as there is still only one copy of Princess in play. This is a Prize; see the Additional Rules."
		},
		{
			"name" : "Young Witch",
			"setId" : 7,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 4,
			"cards" : 2,
			"description" : "Each other player may reveal a Bane card from his hand. If he doesn't, he gains a Curse. [Set-up]: Add an extra Kingdom card pile costing 2 coins or 3 coins to the supply. cards from that pile are Bane cards.",
			"errata" : "This card causes there to be an extra pile in the Supply, called the Bane pile; see Preparation. The extra pile is just like other Kingdom card piles - it can be bought, it can be gained via cards like Horn of Plenty, it counts for the end game condition. When you play Young Witch, after you draw 2 cards and discard 2 cards, each other player may reveal a Bane card from his hand; if he does not, he gains a Curse. This attack hits other players in turn order, which matters when the Curse pile is low. Players may still respond to a Young Witch with Reaction cards like Horse Traders or Moat (from Dominion); those happen before Bane cards are revealed. If Secret Chamber (from Dominion: Intrigue) is the Bane card, first you can reveal it for its Reaction ability, and then, if it's still in your hand, you can reveal it to avoid getting a Curse."
		},
		{
			"name" : "Border Village",
			"setId" : 8,
			"isAction" : true,
			"cost" : 6,
			"cards" : 1,
			"actions" : 2,
			"description" : "When you gain this, gain a card costing less than this.",
			"errata" : "Normally Border Village costs <6>, so it comes with a card costing up to <5>. If Border Village has a different cost (such as due to Highway) then that affects what you gain with it (though Highway would also affect the other cards). Border Village goes to your discard pile first, then the card you gain with it."
		},
		{
			"name" : "Cache",
			"setId" : 8,
			"isTreasure" : true,
			"cost" : 5,
			"coins" : 3,
			"description" : "When you gain this, gain two Coppers.",
			"errata" : "If there are not two Coppers left, gain as many as you can."
		},
		{
			"name" : "Cartographer",
			"setId" : 8,
			"isAction" : true,
			"cost" : 5,
			"cards" : 1,
			"actions" : 1,
			"description" : "Look at the top 4 cards of your deck. Discard any number of them. Put the rest back on top in any order.",
			"errata" : "You draw a card first, then look at the top 4 cards of your deck. If there are fewer than 4 cards left (even after shuffling), just look at as many as you can. Discard any number of the cards you looked at - none, all four, or something in-between - and put the rest back on top of your deck in any order. You do not reveal any of the cards, except whatever ends up on top of your discard pile."
		},
		{
			"name" : "Crossroads",
			"setId" : 8,
			"isAction" : true,
			"cost" : 2,
			"description" : "Reveal your hand. +1 Card per Victory card revealed. If this is the first time you played Crossroads this turn, +3 actions.",
			"errata" : "First reveal your hand, and draw a card for each Victory card you revealed, if any. The revealed cards all stay in your hand. Then, if this is the first time you played a Crossroads this turn, you get +3 Actions. Subsequent Crossroads this turn will give you cards but not Actions. If you use Throne Room on Crossroads, you will play Crossroads twice, getting +3 Actions the first time but not the second time."
		},
		{
			"name" : "Develop",
			"setId" : 8,
			"isAction" : true,
			"cost" : 3,
			"description" : "Trash a card from your hand. Gain a card costing exactly 1 Coin more than it and a card costing exactly 1 Coin less than it, in either order, putting them on top of your deck.",
			"errata" : "First trash a card from your hand, if able. If you trashed a card, gain two cards, one costing exactly <1> more than the trashed card, and one costing exactly <1> less than the trashed card. The gained cards come from the Supply; gain them in either order, resolving any abilities due to gaining them also in that order. If there is no card in the Supply at one of the costs, you still gain the other card if you can. Put the gained cards on top of your deck rather than into your discard pile. If you trash a Copper, which costs <0>, you will fail to gain a card costing -<1> (and try to gain a card costing <1>)."
		},
		{
			"name" : "Duchess",
			"setId" : 8,
			"isAction" : true,
			"cost" : 2,
			"coins" : 2,
			"description" : "Each player (including you) looks at the top card of his deck, and discards it or puts it back. In games using this, when you gain a Duchy, you may gain a Duchess.",
			"errata" : "When a player plays Duchess, each player secretly looks at the top card of their deck, and either discards it or puts it back, their choice. When a player gains a Duchy in a game with Duchess in the Supply, that player may also gain a Duchess, putting it into their discard pile."
		},
		{
			"name" : "Embassy",
			"setId" : 8,
			"isAction" : true,
			"cost" : 5,
			"cards" : 5,
			"description" : "Discard 3 cards. When you gain this, each other player gains a Silver.",
			"errata" : "The Silvers come from the Supply and are put into discard piles. Gaining them is not optional for the other players. If there are not enough Silvers left to go around, deal them out in turn order, starting with the player whose turn it is."
		},
		{
			"name" : "Farmland",
			"setId" : 8,
			"isVictory" : true,
			"cost" : 6,
			"victoryPoints" : 2,
			"description" : "When you buy this, trash a card from your hand. Gain a card costing exactly 2 coins more than the trashed card.",
			"errata" : "When you buy this, you trash a card from your hand if able, and if you did, you gain a card from the Supply costing exactly <2> more than the trashed card if able. If there are no cards left in your hand to trash, you do not trash or gain a card, and if you trashed a card but there are no cards in the Supply costing exactly <2> more than the trashed card, you do not gain a card. This ability only functions when you buy Farmland, not when you gain it some other way. Use 8 copies of Farmland for games with 2 players, 12 for games with 3 or more players."
		},
		{
			"name" : "Fool's Gold",
			"setId" : 8,
			"isTreasure" : true,
			"isReaction" : true,
			"cost" : 2,
			"description" : "[Treasure]: If this is the first time you played a Fool's Gold this turn, this is worth 1 Coin, otherwise it's worth 4 coins. [Reaction]: When another player gains a Province, you may trash this from your hand. If you do, gain a Gold, putting it on your deck.",
			"errata" : "The first Fool's Gold you play in a turn is worth <1>, and all further copies are worth <4>. So if you play three of them, you get <1> + <4> + <4> , or <9> total. Fool's Gold is also a Reaction. When another player gains a Province, you may trash Fool's Gold from your hand to gain a Gold from the Supply, putting it onto your deck. You cannot use this ability when you gain a Province, only when another player does."
		},
		{
			"name" : "Haggler",
			"setId" : 8,
			"isAction" : true,
			"cost" : 5,
			"coins" : 2,
			"description" : "While this is in play, when you buy a card, gain a card costing less than it that is not a Victory card.",
			"errata" : "While this is in play, whenever you buy a card, you gain a card that is cheaper than the card you bought, but not a Victory card. For example, you could buy a Province, and gain a Gold via Haggler. Gaining a card is not optional. The gained card comes from the Supply and is put into your discard pile. Haggler only gives you an extra card when you buy a card, not when you gain a card some other way (such as with Haggler itself). If there is no cheaper card available in the Supply (for example, if you buy Copper), you do not gain a card. Using Throne Room on Haggler will not gain you two cards per card bought, as there is still only one copy of Haggler in play. The bonus is cumulative though; if you have three Hagglers in play, you will gain three more cards for each card you buy."
		},
		{
			"name" : "Highway",
			"setId" : 8,
			"isAction" : true,
			"cost" : 5,
			"cards" : 1,
			"actions" : 1,
			"description" : "While this is in play, cards cost 1 Coin less, but not less than 0 coins.",
			"errata" : "This makes all cards cheaper (to a minimum of <0>) as long as it is in play. This applies to cards everywhere - cards in the Supply, cards in hand, cards in Decks, and so on. For example if you played Highway, then Develop, trashing a Copper, you could gain an Estate, as Estate would cost <1> while Copper would still cost <0>. Using Throne Room on Highway will not make cards cost <2> less, as there is still only one copy of Highway in play. The bonus is cumulative; if you have three Highways in play, all cards cost <3> less (to a minimum of <0>)."
		},
		{
			"name" : "Ill-Gotten Gains",
			"setId" : 8,
			"isTreasure" : true,
			"cost" : 5,
			"coins" : 1,
			"description" : "When you play this, may gain a Copper, putting it into your hand. When you gain this, each other player gains a Curse.",
			"errata" : "When you play this, you may gain a Copper. The Copper comes from the Supply and is put into your hand; you can immediately play it. When you gain Ill-Gotten Gains, each other player gains a Curse. The Curses come from the Supply and go into the players’ discard piles. If there are not enough Curses left to go around, deal them out in turn order. Ill-Gotten Gains is not an Attack, and gaining it is not playing an Attack; cards like Moat do not work against it."
		},
		{
			"name" : "Inn",
			"setId" : 8,
			"isAction" : true,
			"cost" : 5,
			"cards" : 2,
			"actions" : 2,
			"description" : "Discard 2 cards. When you gain this, look through your discard pile (including this), reveal any number of Action cards from it, and shuffle them into your deck.",
			"errata" : "When you gain this, you look through your discard pile (something normally not allowed), and shuffle any number of Action cards from it into your deck. You do not have to shuffle any Action cards into your deck. You can shuffle the Inn you just gained into your deck; it is an Action card in your discard pile. You must reveal the Action cards that you choose to shuffle into your deck. It does not matter what order you leave your discard pile in afterwards."
		},
		{
			"name" : "Jack of all Trades",
			"setId" : 8,
			"isAction" : true,
			"cost" : 4,
			"description" : "Gain a Silver. Look at the top card of your deck, discard it or put it back. Draw until you have 5 cards in hand. You may trash a card from your hand that is not a Treasure.",
			"errata" : "This card does four separate things, in the order listed; you do all of them (the last one is optional). First, gain a Silver from the Supply, putting it into your discard pile. Second, look at the top card of your deck, and either discard it or put it back on top. If this causes you to shuffle, the Silver will be shuffled in. Third, draw cards until you have at least five cards in hand. If you already have five or more cards in hand, you do not draw any cards. Fourth, you may trash a card from your hand that is not a Treasure card."
		},
		{
			"name" : "Mandarin",
			"setId" : 8,
			"isAction" : true,
			"cost" : 5,
			"coins" : 3,
			"description" : "Put a card from your hand on top of your deck. When you gain this, put all Treasures you have in play on top of your deck in any order.",
			"errata" : "When you gain this, you put all of your Treasures from play on top of your deck in any order. You do not have to show this order to other players. You have to put all of your Treasures on top; you cannot leave some out. You only put Treasures from play on top of your deck, not unplayed Treasures from your hand. This does not stop you from having the <> you got from playing those Treasures; for example, if you have +1 Buy and play four Golds and buy a Mandarin, you put the Golds on top of your deck, and still have <7> left to spend."
		},
		{
			"name" : "Margrave",
			"setId" : 8,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 5,
			"cards" : 3,
			"buys" : 1,
			"description" : "Each other player draws a card, then discards down to 3 cards in hand.",
			"errata" : "Drawing a card is not optional for the other players. A player who only has 3 cards or fewer after drawing does not discard."
		},
		{
			"name" : "Noble Brigand",
			"setId" : 8,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 4,
			"coins" : 1,
			"description" : "When you buy this or play it, each other player reveals the top 2 cards of his deck, trashes a revealed Silver or Gold you choose, and discards the rest. If he didn't reveal a Treasure, he gains a Copper. You gain the trashed cards.",
			"errata" : "When you play this, get you get +<1>. When you play this and also when you buy it, each other player reveals the top two cards of their deck, trashes a Silver or Gold they revealed that you choose, and discards the rest. Each of these players that did not reveal a Treasure at all gains a Copper from the Supply, putting it into their discard pile. Finally, you gain all of the Silvers and Golds trashed this way. This cannot trash any Treasures except Silver or Gold. Gaining a Noble Brigand without buying it does not cause this ability to happen. Noble Brigand is an Attack card, and when you announce it, players can use cards like Moat in response. However, buying a Noble Brigand is not \"playing an Attack card,\" and so cards like Moat cannot respond to that."
		},
		{
			"name" : "Nomad Camp",
			"setId" : 8,
			"isAction" : true,
			"cost" : 4,
			"coins" : 2,
			"buys" : 1,
			"description" : "When you gain this, put it on top of your deck.",
			"errata" : "When you gain this card, it goes on top of your deck rather than into your discard pile. This is true whether you gained it due to buying it, or gained it some other way."
		},
		{
			"name" : "Oasis",
			"setId" : 8,
			"isAction" : true,
			"cost" : 3,
			"cards" : 1,
			"actions" : 1,
			"coins" : 1,
			"description" : "Discard a card.",
			"errata" : "You draw a card, get +1 Action and +<1>, and then discard a card."
		},
		{
			"name" : "Oracle",
			"setId" : 8,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 3,
			"cards" : 2,
			"description" : "Each player (including you) reveals the top 2 cards of his deck, and you choose one: either he discards them, or he puts them back on top in an order he chooses.",
			"errata" : "First, each player, including you, reveals the top two cards of their deck, and either discards both of them or puts both of them back on top, your choice. A player putting the cards back puts them back in an order they choose, and without needing to reveal that order. Then, you draw two cards. So if you put back the cards you revealed, you will draw them."
		},
		{
			"name" : "Scheme",
			"setId" : 8,
			"isAction" : true,
			"cost" : 3,
			"cards" : 1,
			"actions" : 1,
			"description" : "At the start of Clean-up this turn, you may choose an Action card you have in play. If you discard it from play this turn, put it on your deck.",
			"errata" : "When you play this, you draw a card, get +1 Action, and set up an effect to happen later in the turn; once, when you discard an Action card from play, you can put it onto your deck. The Action card can be Scheme itself, or any other Action card you have in play, which might have been played before or after you played Scheme. Scheme is cumulative; if you play two Schemes, or Throne Room a Scheme, you will be able to put up to two discarded Action cards onto your deck, and so on."
		},
		{
			"name" : "Silk Road",
			"setId" : 8,
			"isVictory" : true,
			"cost" : 4,
			"description" : "Worth 1 VP for every 4 Victory cards in your deck (round down).",
			"errata" : "Silk Roads count themselves. Round down; if you have 11 Victory cards, Silk Road is worth 2 <v>. Use 8 copies of Silk Road for games with 2 players, 12 for games with 3 or more players."
		},
		{
			"name" : "Spice Merchant",
			"setId" : 8,
			"isAction" : true,
			"cost" : 4,
			"description" : "You may trash a Treasure from your hand. If you do, choose one: +2 cards and +1 Action, or +2 coins and +1 Buy.",
			"errata" : "You may trash a Treasure card from your hand. This is optional. If you did trash a Treasure card, you choose either to get +2 Cards and +1 Action, or +<2> and +1 Buy."
		},
		{
			"name" : "Stables",
			"setId" : 8,
			"isAction" : true,
			"cost" : 5,
			"description" : "You may discard a Treasure. If you do, +3 cards and +1 Action.",
			"errata" : "You may discard a Treasure card from your hand. This is optional. If you did discard one, you get +3 Cards and +1 Action. You draw after discarding, so if you have to shuffle to get the 3 cards, you will end up shuffling in the card you discarded."
		},
		{
			"name" : "Trader",
			"setId" : 8,
			"isAction" : true,
			"isReaction" : true,
			"cost" : 4,
			"description" : "[Action]: Trash a card from your hand. Gain a number of silvers equal to its cost in coins. [Reaction]: When you would gain a card, you may reveal this from your hand. If you do, instead, gain a silver.",
			"errata" : "When you play this, trash a card from your hand, and if you did, gain a number of Silvers equal to the cost of that card in <>. The Silvers come from the Supply and are put into your discard pile. You only gain Silvers if you trashed a card. If you trash a card costing <0>, such as Copper, you will gain zero Silvers. You can trash Silver if you want; you will gain three Silvers for it normally. If costs are different, such as due to playing Highway, then Trader will give you a different number of Silvers, based on the current costs. For example if you play Highway and then Trader, trashing an Estate, you will only gain one Silver. If you trash a card with   in its cost, from Dominion: Alchemy, you do not get anything for the <p>, just for the <> that the card cost. Trader is also a Reaction. When you gain a card, whether due to buying it or gaining it some other way, you may reveal Trader from your hand to instead gain a Silver from the Supply. If you do this, you gain a Silver, not the card you would have gained; if something would have happened due to gaining the other card, it does not happen, because you did not gain it. For example if you buy Ill-Gotten Gains but use Trader to gain Silver instead, no-one will gain a Curse. However if something happens when you buy a card, that will still happen if you replace gaining the card with gaining Silver. For example you can buy Farmland, trash a card from your hand and gain one costing <2> more, then use Trader to gain Silver rather than Farmland. If the card you were going to gain was not going to your discard pile, the Silver still goes to your discard pile; if the card you were going to gain did not come from the Supply, the Silver still comes from the Supply. If there are no Silvers left in the Supply, you can still reveal Trader when you gain a card and gain nothing instead of the card you would have gained. If you are told to gain a card that has no copies left, you cannot use Trader to instead gain a Silver."
		},
		{
			"name" : "Tunnel",
			"setId" : 8,
			"isVictory" : true,
			"isReaction" : true,
			"cost" : 3,
			"victoryPoints" : 2,
			"description" : "When you discard this other than during a Clean-up phase, you may reveal it. If you do, gain a Gold.",
			"errata" : "Tunnel's Reaction ability functions when you discard it. You cannot simply choose to discard it; something has to let you or make you discard it. This ability functions whether you discard Tunnel on your own turn (such as due to Oasis) or on someone else's (such as due to Margrave). It functions if Tunnel is discarded from your hand (such as due to Oasis) or from your deck (such as due to Cartographer), or when set aside. If Tunnel would normally not necessarily be revealed (such as when discarding multiple cards to Cartographer), you have to reveal it to get the Gold. Revealing it is optional, even if Tunnel was already revealed for some other reason; you are not forced to gain a Gold. This ability does not function if cards are put into your discard pile without being discarded, such as when you buy a card, when you gain a card directly (such as with Border Village), or when your deck is put into your discard pile (such as with Scavenger from Dominion: Dark Ages). It also does not function during Clean-up, when you normally discard all of your played and unplayed cards. The key thing to look for is a card actually telling you to \"discard\" cards. The Gold you gain comes from the Supply and is put into your discard pile."
		},
		{
			"name" : "Altar",
			"setId" : 9,
			"isAction" : true,
			"cost" : 6,
			"description" : "Trash a card from your hand. Gain a card costing up to $5.",
			"errata" : "You trash a card from your hand if you can, and then gain a card whether or not you trashed one."
		},
		{
			"name" : "Armory",
			"setId" : 9,
			"isAction" : true,
			"cost" : 4,
			"description" : "Gain a card costing up to $4. Put it on top of your deck.",
			"errata" : "The card you gain goes directly to the top of your deck."
		},
		{
			"name" : "Band of Misfits",
			"setId" : 9,
			"isAction" : true,
			"cost" : 5,
			"description" : "Play this as if it were an Action card in the Supply costing less than it that you choose. This is that card until it leaves play.",
			"errata" : "When you play this, you pick an Action card from the Supply that costs less than it, and treat this card as if it were the card you chose. Normally this will just mean that you follow the instructions on the card you picked. For example with Village in the Supply, you could play Band of Misfits as Village and get +1 Card +2 Actions. Band of Misfits also gets the chosen card's cost, name, and types, until it leaves play. If you play Band of Misfits as a card that moves itself somewhere, Band of Misfits will do that; for example Band of Misfits played as Death Cart, choosing to trash itself, will put Band of Misfits into the trash. If you play Band of Misfits as a card that does something when trashed or discarded from play, and that thing happens, Band of Misfits will do that; for example if you play Band of Misfits as Hermit and buy no cards, in Clean-up Band of Misfits will be trashed and you will get a Madman. If you play Band of Misfits as a Duration card, or as a Throne Room on a Duration card, Band of Misfits will stay in play the same way the Duration card or Throne Room would. If you play Band of Misfits multiple times such as via a Throne Room, you will only pick what to play it as the first time; the other times it will be the same thing. Once in play, Band of Misfits is the thing it copied, rather than a Band of Misfits; for example Horn of Plenty (from Cornucopia) will count the Band of Misfits as the card it copied. Band of Misfits can only be played as a visible card in the Supply, and the top card of a pile; it cannot be played as a card from an empty pile, or as a card that has not been uncovered (such as Sir Martin when another Knight is on top of him), or as a non-Supply card (like Mercenary)."
		},
		{
			"name" : "Bandit Camp",
			"setId" : 9,
			"isAction" : true,
			"cost" : 5,
			"cards" : 1,
			"actions" : 2,
			"description" : "Gain a Spoils.",
			"errata" : "Draw a card before gaining a Spoils. The Spoils comes from the Spoils pile, which is not part of the Supply. If there are no Spoils cards left, you do not get one."
		},
		{
			"name" : "Beggar",
			"setId" : 9,
			"isAction" : true,
			"isReaction" : true,
			"cost" : 2,
			"description" : "[Action]: Gain 3 Coppers, putting them into your hand. [Reaction]: When another player plays an Attack card, you may discard this. If you do, gain two Silvers, putting one on top of your deck.",
			"errata" : "When you play this, you gain three Coppers, putting them into your hand. If there are not three Coppers left, just gain as many as you can. When another player plays an Attack card, you may discard this from your hand. If you do, you gain two Silvers, putting one on your deck and the other into your discard pile. If there is only one Silver left, put it on your deck; if there are no Silvers left, you do not gain any."
		},
		{
			"name" : "Catacombs",
			"setId" : 9,
			"isAction" : true,
			"cost" : 5,
			"description" : "[Action]: Look at the top 3 cards of your deck. Choose one: Put them into your hand; or discard them and +3 cards. [Trash]: When you trash this, gain a cheaper card.",
			"errata" : "When you play this, you look at the top three cards of your deck, and either put all three into your hand, or discard all three and draw the next three cards. If you discard them and have to shuffle to draw three cards, you will shuffle in the cards you discarded and may end up drawing some of them. When you trash Catacombs, you gain a card costing less than it. This happens whether Catacombs is trashed on your turn or someone else's, and no matter who has the card that trashed it."
		},
		{
			"name" : "Count",
			"setId" : 9,
			"isAction" : true,
			"cost" : 5,
			"description" : "Choose one: Discard 2 cards; put a card from your hand on top of your deck; or gain a Copper. Choose one: +$3; trash your hand; or gain a Duchy.",
			"errata" : "This card gives you two separate choices: first you either discard two cards, or put a card from your hand on top of your deck, or gain a Copper; after resolving that, you either get +<3>, or trash your hand, or gain a Duchy. For example you might choose to discard two cards, then gain a Duchy. You can choose an option even if you cannot do it. If you trash multiple cards that do something when trashed at once, trash them all, then choose an order to resolve the things that happen due to them being trashed."
		},
		{
			"name" : "Counterfeit",
			"setId" : 9,
			"isTreasure" : true,
			"cost" : 5,
			"coins": 1,
			"buys": 1,
			"description" : "When you play this, you may play a treasure from your hand twice. If you do, trash that treasure.",
			"errata" : "When you play this, you get <1> and +1 Buy, and you may play a Treasure card from your hand twice. If you choose to do that, you trash that Treasure. You still get any coins that Treasure gave you from playing it, despite trashing it. If you use Counterfeit to play Spoils twice, you will get +<6> (in addition to the <1> from Counterfeit) and return Spoils to the Spoils pile; you will be unable to trash it. If you use Counterfeit to play a Treasure that does something special when you play it (such as another Counterfeit), you will do that thing twice."
		},
		{
			"name" : "Cultist",
			"setId" : 9,
			"isAction" : true,
			"isAttack" : true,
			"isLooter" : true,
			"cost" : 5,
			"cards" : 2,
			"description" : "[Action]: Each other player gains a Ruins. You may play a Cultist from your hand. [Trash]: When you trash this, +3 cards.",
			"errata" : "When you play this, you draw two cards, then each other player gains a Ruins. Go in turn order starting to your left; each player takes the top Ruins, revealing the next one each time. If the Ruins pile runs out, players stop gaining them at that point. After giving out Ruins, you may play another Cultist from your hand. It can be one you just drew from playing Cultist, or one you already had in your hand. Playing a Cultist this way does not use up any extra Actions you were allowed to play due to cards like Fortress - the original Cultist uses up one Action and that is it. When you trash a Cultist, you draw three cards. This happens whether or not it is your turn, and whether or not the card that causes Cultist to be trashed was yours. If you trash a Cultist while revealing cards, such as to a Knight attack, you do not draw the revealed cards that are about to be discarded."
		},
		{
			"name" : "Death Cart",
			"setId" : 9,
			"isAction" : true,
			"isLooter" : true,
			"cost" : 4,
			"coins" : 5,
			"description" : "[Action]: You may trash an Action card from your hand. If you don't, trash this. [Gain]: When you gain this, gain two Ruins.",
			"errata" : "When you play Death Cart, you get +<5>, and either trash an Action card from your hand, or trash the Death Cart. If you have no Action card in your hand, you will have to trash the Death Cart, but you can trash the Death Cart whether or not you have an Action card in hand. When you gain a Death Cart, either from buying it or from gaining it some other way, you also gain two Ruins. You just take the top two, whatever they are. If there are not enough Ruins left, take as many as you can. The other players get to see which ones you got. If you use Trader (from Hinterlands) to take a Silver instead of a Death Cart, you do not gain any Ruins. It does not matter whose turn it is; if you use Ambassador (from Seaside) to give Death Carts to each other player, those players also gain Ruins. Passing cards with Masquerade (from Intrigue) does not count as gaining them."
		},
		{
			"name" : "Feodum",
			"setId" : 9,
			"isVictory" : true,
			"cost" : 4,
			"description" : "[Action]: Worth 1 VP for every 3 Silvers in your deck. [Trash]: When you trash this, gain 3 Silvers.",
			"errata" : "This is a Victory card, so use eight copies for games with two players, or 12 for games with three or more players. At the end of the game, each Feodum is worth 1 <v> for every three Silvers in your deck, rounded down. For example if you have 11 Silvers, your Feodums are worth 3 <v> each. If Feodum is trashed, you gain three Silvers. If there are not enough Silvers left, gain as many as you can."
		},
		{
			"name" : "Forager",
			"setId" : 9,
			"isAction" : true,
			"cost" : 3,
			"actions" : 1,
			"buys": 1,
			"description" : "Trash a card from your hand. +$1 per differently named Treasure in the trash.",
			"errata" : "Trash a card from your hand if you can. Whether or not you can, you still get + <1> per differently named Treasure in the trash, plus +1 Action and +1 Buy. Multiple copies of the same Treasure card do not increase how much you get. For example if the trash has four Coppers and a Counterfeit, you get +<2>."
		},
		{
			"name" : "Fortress",
			"setId" : 9,
			"isAction" : true,
			"cost" : 4,
			"cards" : 1,
			"actions" : 2,
			"description" : "[Trash]: When you trash this, put it into your hand.",
			"errata" : "When you play this, you draw a card and get +2 Actions. If this is trashed, you take it from the trash and put it into your hand. This happens no matter whose turn it is when Fortress is trashed. It is not optional. You still trashed Fortress, even though you get it back; for example if you play Death Cart and choose to trash Fortress, the \"if you do\" on Death Cart is true, you did trash an Action, so you do not trash Death Cart."
		},
		{
			"name" : "Graverobber",
			"setId" : 9,
			"isAction" : true,
			"cost" : 5,
			"description" : "Choose one: Gain a card from the trash costing from $3 to $6, putting it on top of your deck; or trash an Action card from your hand and gain a card costing up to $3 more than it.",
			"errata" : "You choose either option, then do as much of it as you can; you can choose an option even if you will not be able to do it. You can look through the trash at any time. If you choose to gain a card from the trash, the other players get to see what it is, and it goes on top of your deck. If there is no card in the trash costing from <3> to <6>, you will fail to gain one. Cards with <p> (from Alchemy) or <d> (from Empires) in the cost do not cost from <3> to <6>. If you choose instead to trash an Action card from your hand, the card you gain is put into your discard pile."
		},
		{
			"name" : "Hermit",
			"setId" : 9,
			"isAction" : true,
			"cost" : 3,
			"description" : "[Action]: Look through your discard pile. You may trash a card that is not a Treasure, from your discard pile or your hand. Gain a card costing up to $3. [Discard]: When you discard this from play, if you didn't buy any cards this turn, trash this and gain a Madman (from the Madman pile).",
			"errata" : "When you play this, look through your discard pile, and then you may choose to trash a card that is not a Treasure, from either your hand or your discard pile. You do not have to trash a card and cannot trash Treasures. After trashing or not, you must gain a card costing up to <3>. Then, when you discard Hermit from play - normally, in Clean-up, after playing it in your Action phase - if you did not buy any cards this turn, you trash Hermit and gain a Madman. The Madman comes from the Madman pile, which is not in the Supply. It does not matter whether or not you gained cards other ways, only whether you did not buy a card. If there are no Madman cards left, you do not gain one. If Hermit is not discarded from play during Clean-up - for example, if you put it on your deck with Scheme (from Hinterlands) - then the ability that trashes it will not trigger."
		},
		{
			"name" : "Hunting Grounds",
			"setId" : 9,
			"isAction" : true,
			"cost" : 6,
			"cards" : 4,
			"description" : "[Trash]: When this is trashed, gain a Duchy or 3 Estates.",
			"errata" : "When you play this, draw four cards. If this is trashed, you either gain a Duchy or three Estates, your choice. If you choose the three Estates and there are not three left, just gain as many as you can."
		},
		{
			"name" : "Ironmonger",
			"setId" : 9,
			"isAction" : true,
			"cost" : 4,
			"cards" : 1,
			"actions" : 1,
			"description" : "Reveal the top card of your deck; you may discard it. If it is an Action card, +1 Action; a Treasure card, +$1; a Victory card, +1 Card.",
			"errata" : "First you draw a card, then you reveal the top card of your deck, then you either discard that card or put it back on top of your deck. Then you get bonuses based on the types of the card you revealed. A card with multiple types gives you all relevant bonuses; if you revealed Harem (from Intrigue), you would both draw a card and get +<1>."
		},
		{
			"name" : "Junk Dealer",
			"setId" : 9,
			"isAction" : true,
			"cost" : 5,
			"cards" : 1,
			"actions" : 1,
			"coins": 1,
			"description" : "Trash a card from your hand.",
			"errata" : "You draw before trashing. You have to trash a card from your hand if you can."
		},
		{
			"name" : "Knights",
			"setId" : 9,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 5,
			"description" : "One of each, all shuffled into one Kingdom pile.",
			"errata" : "This is a pile in which each card is different. There is the same basic ability on each card, but also another ability unique to that card in the pile, and they all have different names. Shuffle the Knights pile before playing it, keeping it face down except for the top one, which is the only card that can be gained from the pile. See Additional Rules and Preparation. Follow the rules on Knights in order from top to bottom; Sir Michael causes players to discard before it trashes cards. The ability they have in common is, each other player reveals the top two cards of their deck, trashes one of them that they choose that costs from   to , and discards the rest; then, if a Knight was trashed, you trash the Knight you played that caused this trashing. Resolve this ability in turn order, starting with the player to your left. Cards with <p> (from Alchemy) or <d> (from Empires) in the cost do not cost from <3> to <6>. The player losing a card only gets a choice if both cards revealed cost from <3> to <6>. If they both do and one is a Knight but the player picks the other card, that will not cause the played Knight to be trashed."
		},
		{
			"name" : "Madman",
			"setId" : 9,
			"isAction" : true,
			"excludeFromSupply" : true,
			"cost" : 0,
			"actions" : 2,
			"description" : "Return this to the Madman pile. If you do, +1 Card per card in your hand. (This is not in the Supply.)",
			"errata" : ""
		},
		{
			"name" : "Marauder",
			"setId" : 9,
			"isAction" : true,
			"isAttack" : true,
			"isLooter" : true,
			"cost" : 4,
			"description" : "Gain a Spoils. Each other player gains a Ruins.",
			"errata" : "First you gain a Spoils. It comes from the Spoils pile, which is not part of the Supply. If there are no Spoils cards left, you do not get one. Then each other player gains a Ruins. Go in turn order starting to your left; each player takes the top Ruins, revealing the next one each time. If the Ruins pile runs out, players stop gaining them at that point."
		},
		{
			"name" : "Market Square",
			"setId" : 9,
			"isAction" : true,
			"isReaction" : true,
			"cost" : 3,
			"cards" : 1,
			"actions" : 1,
			"buys": 1,
			"description" : "[Reaction]: When one of your cards is trashed, you may discard this from your hand. If you do, gain a Gold.",
			"errata" : "When you play this, you draw a card and get +1 Action and +1 Buy. When one of your cards is trashed, you may discard Market Square from your hand. If you do, you gain a Gold. If there is no Gold left in the Supply, you do not gain one. You may discard multiple Market Squares when a single card of yours is trashed."
		},
		{
			"name" : "Mercenary",
			"setId" : 9,
			"isAction" : true,
			"isAttack" : true,
			"excludeFromSupply" : true,
			"cost" : 0,
			"description" : "You may trash 2 cards from your hand. If you do, +2 cards, + $2, and each other player discards down to 3 cards in hand. (This is not in the Supply.)",
			"errata" : ""
		},
		{
			"name" : "Mystic",
			"setId" : 9,
			"isAction" : true,
			"cost" : 5,
			"actions" : 1,
			"coins": 2,
			"description" : "Name a card. Reveal the top card of your deck. If it's the named card, put it into your hand.",
			"errata" : "You get +1 Action and + <2>. Then name a card (\"Copper,\" for example - not \"Treasure\") and reveal the top card of your deck; if you named the card you revealed, put the revealed card into your hand. If you do not name the right card, put the revealed card back on top. Names need to match exactly for you to get the card; for example Sir Destry and Sir Martin do not match. You do not need to name a card available in the Supply."
		},
		{
			"name" : "Pillage",
			"setId" : 9,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 5,
			"description" : "Trash this. Each other player with 5 or more cards in hand reveals his hand and discards a card that you choose. Gain 2 Spoils.",
			"errata" : "First trash Pillage. Then each other player with 5 or more cards in hand reveals their hand and discards a card of your choice. This happens in turn order, starting with the player to your left. Then you gain two Spoils cards. The two Spoils cards come from the Spoils pile, which is not part of the Supply. If there are no Spoils cards left, you do not get one; if there is only one, you just get one."
		},
		{
			"name" : "Poor House",
			"setId" : 9,
			"isAction" : true,
			"cost" : 1,
			"coins": 4,
			"description" : "Reveal your hand. -$1 per Treasure card in your hand, to a minimum of $0.",
			"errata" : "First you get +<4>. Then you reveal your hand, and lose   per Treasure card in it. You can lose more than <4> this way, but cannot go below <0>."
		},
		{
			"name" : "Procession",
			"setId" : 9,
			"isAction" : true,
			"cost" : 4,
			"description" : "You may play an Action card from your hand twice. Trash it. Gain an Action card costing exactly $1 more than it.",
			"errata" : "Playing an Action card from your hand is optional. If you do play one, you then play it a second time, then trash it, then gain an Action card costing exactly <1> more than it (even if somehow you failed to trash it). Gaining a card is not optional once you choose to play an Action card, but will fail to happen if no card in the Supply costs the exact amount needed. If something happens due to trashing the card - for example drawing three cards due to trashing a Cultist - that will resolve before you gain a card. This does not use up any extra Actions you were allowed to play due to cards like Fortress - Procession itself uses up one Action and that is it. You cannot play any other cards in between resolving the Procession-ed Action card multiple times, unless that Action card specifically tells you to (such as Procession itself does). If you Procession a Procession, you will play one Action twice, trash it, gain an Action card costing <1> more, then play another Action twice, trash it, gain an Action card costing <1> more, then trash the Procession and gain an Action costing <1> more than it. If you Procession a card that gives you +1 Action, such as Vagrant, you will end up with two Actions to use afterwards, rather than the one you would have left if you just played two Vagrants. If you use Procession on a Duration card, Procession will be discarded in the same turn's Clean-up, since the Duration card will no longer be in play."
		},
		{
			"name" : "Rats",
			"setId" : 9,
			"isAction" : true,
			"cost" : 4,
			"cards" : 1,
			"actions" : 1,
			"description" : "[Action]: Gain a Rats. Trash a card from your hand other than a Rats (or reveal a hand of all Rats). [Trash]: When this is trashed, +1 Card.",
			"errata" : "Follow the instructions in order. First draw a card; then gain a Rats; then trash a card from your hand that is not a Rats card. If there are no Rats cards left, you do not gain one. If you have no cards in your hand other than Rats, reveal your hand and you do not trash a card. If Rats is trashed, you draw a card. This happens whether it is your turn or another player's, and regardless of which player has the card that trashed Rats. There are 20 copies of Rats, rather than the usual 10; the pile starts with all 20, regardless of the number of players."
		},
		{
			"name" : "Rebuild",
			"setId" : 9,
			"isAction" : true,
			"cost" : 5,
			"description" : "Name a card. Reveal cards from the top of your deck until you reveal a Victory card that is not the named card. Discard the other cards. Trash the Victory card and gain a Victory card costing up to $3 more than it.",
			"errata" : "You can name any card, whether or not it is being used this game or is a Victory card. Then reveal cards from your deck until you reveal a Victory card that is not what you named. If you run out of cards, shuffle your discard pile and continue, without shuffling in the revealed cards. If you run out of cards with no cards left in your discard pile, stop there, discard everything, and nothing more happens. If you did find a Victory card that was not what you named, you discard the other revealed cards, trash the Victory card, and gain a Victory card costing up to   more than the trashed card."
		},
		{
			"name" : "Rogue",
			"setId" : 9,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 5,
			"coins": 2,
			"description" : "If there are any cards in the trash costing from $3 to $6, gain one of them. Otherwise, each other player reveals the top 2 cards of his deck, trashes one of them costing from $3 to $6, and discards the rest.",
			"errata" : "If there is a card in the trash costing from <3> to <6>, you have to gain one of them; it is not optional. You can look through the trash at any time. The other players get to see what card you took. The gained card goes into your discard pile. Cards with <p> (from Alchemy) or <d> (from Empires) in the cost do not cost from <3> to <6>. If there was no card in the trash costing from <3> to <6>, you instead have each other player reveal the top two cards of their deck, trash one of them of their choice that costs from <3> to <6> (if possible), and discard the rest. Go in turn order, starting with the player to your left."
		},
		{
			"name" : "Sage",
			"setId" : 9,
			"isAction" : true,
			"cost" : 3,
			"actions" : 1,
			"description" : "Reveal cards from the top of your deck until you reveal one costing $3 or more. Put that card into your hand and discard the rest.",
			"errata" : "If you run out of cards while revealing cards, shuffle your discard pile (not including the revealed cards) and continue. If you run out of cards to reveal and have no cards in your discard pile, stop there; discard everything revealed, and you do not get a card. If you find a card costing <3> or more, put that one into your hand and discard the rest. For example you might reveal Copper, then Copper, then Curse, then Province; Province costs <8>, so you would stop there, put Province in your hand, and discard the two Coppers and the Curse."
		},
		{
			"name" : "Scavenger",
			"setId" : 9,
			"isAction" : true,
			"cost" : 4,
			"coins": 2,
			"description" : "You may put your deck into your discard pile. Look through your discard pile and put one card from it on top of your deck.",
			"errata" : "Putting your deck into your discard pile is optional, but putting a card from your discard pile on top of your deck is not; you do it unless there are no cards in your discard pile. Putting your deck into your discard pile will not trigger Tunnel (from Hinterlands)."
		},
		{
			"name" : "Spoils",
			"setId" : 9,
			"isTreasure" : true,
			"excludeFromSupply" : true,
			"cost" : 0,
			"coins": 3,
			"description" : "When you play this, return it to the pile.",
			"errata" : ""
		},
		{
			"name" : "Squire",
			"setId" : 9,
			"isAction" : true,
			"cost" : 2,
			"coins": 1,
			"description" : "[Action]: Choose one: +2 actions; or +2 buys; or gain a Silver. [Trash]: When you trash this, gain an Attack card.",
			"errata" : "When you play this, you get +<1>, and your choice of either +2 Actions, +2 Buys, or gaining a Silver. If Squire is trashed somehow, you gain an Attack card. You can gain any Attack card available in the Supply, but if no Attack card is available, you do not gain one."
		},
		{
			"name" : "Storeroom",
			"setId" : 9,
			"isAction" : true,
			"cost" : 3,
			"buys": 1,
			"description" : "Discard any number of cards. +1 Card per card discarded. Discard any number of cards. +$1 per card discarded the second time.",
			"errata" : "Discard any number of cards from your hand, and draw as many cards as you discarded. Then, discard any number of cards - which could include cards you just drew - and you get +<1> per card you discarded that time."
		},
		{
			"name" : "Urchin",
			"setId" : 9,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 3,
			"cards" : 1,
			"actions" : 1,
			"description" : "[Action] Each other player discards down to 4 cards in hand. [Attack] When you play another Attack card with this in play, you may trash this. If you do, gain a Mercenary from the Mercenary pile.",
			"errata" : "When you play this, you draw a card and get +1 Action, then each other player discards down to four cards in hand. Players who already have four or fewer cards in hand do not do anything. While Urchin is in play, when you play another Attack card, before resolving it, you may trash the Urchin. If you do, you gain a Mercenary. The Mercenary comes from the Mercenary pile, which is not in the Supply. If there are no Mercenaries left you do not gain one. If you play the same Urchin twice in one turn, such as via Procession, that does not let you trash it for a Mercenary. If you play two different Urchins however, playing the second one will let you trash the first one."
		},
		{
			"name" : "Vagrant",
			"setId" : 9,
			"isAction" : true,
			"cost" : 2,
			"cards" : 1,
			"actions" : 1,
			"coins": 1,
			"description" : "Reveal the top card of your deck. If it's a Victory card, Curse, Ruins, or Shelter, put it into your hand.",
			"errata" : "You draw a card before revealing your top card. If the top card of your deck is a Curse, Ruins, Shelter, or Victory card, it goes into your hand; otherwise it goes back on top."
		},
		{
			"name" : "Wandering Minstrel",
			"setId" : 9,
			"isAction" : true,
			"cost" : 4,
			"cards" : 1,
			"actions" : 2,
			"description" : "Reveal the top 3 cards of your deck. Put the actions back on top in any order and discard the rest.",
			"errata" : "First draw a card, then reveal the top three cards of your deck, shuffling your discard pile if there aren't enough cards in your deck. If there still are not enough after shuffling, just reveal what you can. Put the revealed Action cards on top of your deck in any order, and discard the other cards. If you didn't reveal any Action cards, no cards will be put on top."
		},
		{
			"name" : "Advisor",
			"setId" : 10,
			"isAction" : true,
			"cost" : 4,
			"actions" : 1,
			"description" : "Reveal the top 3 cards of your deck. The player to your left chooses one of them. Discard that card. Put the other cards into your hand.",
			"errata" : "If there are not three cards in your deck, reveal what you can, then shuffle your discard pile into your deck to get the other cards. If there still are not enough, just reveal what you can. No matter how many you revealed, the player to your left chooses one for you to discard, and the remaining cards go into your hand."
		},
		{
			"name" : "Baker",
			"setId" : 10,
			"isAction" : true,
			"cost" : 5,
			"cards" : 1,
			"actions" : 1,
			"description" : "[Action]: Take a Coin token. [Setup]: Setup: Each player takes a Coin token.",
			"errata" : "When you play this, you draw a card, get +1 Action, and take a Coin token. In games using this card, each player starts the game with a Coin token. This includes games using the promo card Black Market in which Baker is in the Black Market deck."
		},
		{
			"name" : "Butcher",
			"setId" : 10,
			"isAction" : true,
			"cost" : 5,
			"description" : "Take 2 Coin tokens. You may trash a card from your hand and then pay any number of Coin tokens. If you did trash a card, gain a card with a cost of up to the cost of the trashed card plus the number of Coin tokens you paid.",
			"errata" : "First take two Coin tokens. Then you may trash a card from your hand and pay any number of Coin tokens (returning them to the pile). The number of Coin tokens you pay can be zero. Butcher itself is no longer in your hand and so cannot trash itself (though it can trash another copy of Butcher). If you trashed a card, you gain a card costing up to the cost of the trashed card plus the number of Coin tokens you paid. For example, you could trash an Estate and pay six Coin tokens to gain a Province, or you could trash another Butcher and pay zero Coin tokens to gain a Duchy. You can pay the Coin tokens you just got. Paying Coin tokens for this ability does not get you coins to spend, it just changes what cards you can gain with this ability."
		},
		{
			"name" : "Candlestick Maker",
			"setId" : 10,
			"isAction" : true,
			"cost" : 2,
			"actions" : 1,
			"buys": 1,
			"description" : "Take a Coin token.",
			"errata" : "You get +1 Action and +1 Buy, and take a Coin token."
		},
		{
			"name" : "Doctor",
			"setId" : 10,
			"isAction" : true,
			"cost" : 3,
			"overpay" : true,
			"description" : "[Action]: name a card. Reveal the top 3 cards of your deck. Trash the matches. Put the rest back on top in any order. [Overpay]: When you buy this, you may overpay for it. For each $1 you overpaid, look at the top card of your deck; trash it, discard it, or put it back.",
			"errata" : "When you play this, you name a card, reveal the top three cards of your deck, trash each of those cards that has that name, and put the other cards back on your deck in any order. You do not have to name a card being used this game. If there are fewer than three cards left in your deck, reveal the remaining cards, and shuffle your discard pile (which does not include those cards) to get the remainder needed to reveal. If there are still not enough cards, just reveal as many as you can. When you buy this, for each extra <1> you pay over the cost, you look at the top card of your deck, and either trash it, discard it, or put it back on top. If there are no cards left in your deck, shuffle your discard pile into your deck (including any cards already discarded to this overpay ability this turn), and if there still are no cards in it, you do not look at one. If you overpay more than <1>, you may do different things for each card you look at, and you will look at the same card again if you put it back on top. For example if you bought Doctor for <7>, you would look at the top card four times; you might end up first trashing a Copper, then discarding a Province, then putting a Silver back on top, then putting that Silver back on top again."
		},
		{
			"name" : "Herald",
			"setId" : 10,
			"isAction" : true,
			"cost" : 4,
			"overpay" : true,
			"cards" : 1,
			"actions" : 1,
			"description" : "[Action]: Reveal the top card of your deck. If it is an Action, play it. [Overpay]: When you buy this, you may overpay for it. For each $1 you overpaid, look through your discard pile and put a card from it on top of your deck.",
			"errata" : "When you play this, first draw a card and get +1 Action, then reveal the top card of your deck. If it is an Action card, play it; this is not optional. Playing the Action card does not \"use up\" one of your Action plays for the turn. Cards with multiple types, one of which is Action (such as Great Hall from Dominion: Intrigue), are Action cards. If Herald plays a Duration card (from Dominion: Seaside), the Herald is still discarded normally at end of turn, as it is not needed to track anything. When you buy this, you put one card from your discard pile on top of your deck for each extra <1> you pay over the cost. For example, if you buy Herald for <6>, you will put two cards from your discard pile on top of your deck. This card lets you look through your discard pile; normally you cannot. You cannot look through your discard pile first to see how much you want to overpay, and once you overpay you must put the appropriate number of cards on top of your deck if possible. If you overpay enough to put more cards on your deck than there are cards in your discard pile, you just put all of your discard pile onto your deck. You may not look through your discard pile if you buy Herald without overpaying for it. When you put multiple cards on your deck due to overpaying for a Herald, put them on your deck in any order."
		},
		{
			"name" : "Journeyman",
			"setId" : 10,
			"isAction" : true,
			"cost" : 5,
			"description" : "Name a card. Reveal cards from the top of your deck until you reveal 3 cards that are not the named card. Put those cards into your hand and discard the rest.",
			"errata" : "This draws you three cards that are not a particular card. First name a card. It does not have to be a card being used this game. Then reveal cards from the top of your deck until you have revealed three cards that are not the named card. If you run out of cards without finding three, shuffle your discard pile into your deck and continue. If you still cannot find three, stop. Put the cards you found that were not the named card into your hand and discard the rest."
		},
		{
			"name" : "Masterpiece",
			"setId" : 10,
			"isTreasure" : true,
			"cost" : 3,
			"overpay" : true,
			"coins" : 1,
			"description" : "When you buy this, you may overpay for it. If you do, gain a Silver per $1 you overpaid.",
			"errata" : "This is a Treasure worth <1>, like Copper. When you buy it, you gain a Silver for each extra <1> you pay over the cost. For example, if you buy a Masterpiece for <6>, you gain three Silvers."
		},
		{
			"name" : "Merchant Guild",
			"setId" : 10,
			"isAction" : true,
			"cost" : 5,
			"coins" : 1,
			"buys" : 1,
			"description" : "While this is in play, when you buy a card, take a Coin token.",
			"errata" : "When you play this, you get +1 Buy and +<1>. While this is in play, any time you buy a card you also take a Coin token. Remember that you may only spend Coin tokens prior to buying cards, so you will not be able to immediately spend that Coin token. This ability is cumulative; if you have two Merchant Guilds in play, each card you buy will get you two Coin tokens. However if you play a Merchant Guild multiple times but only have one in play, such as with Throne Room (from Dominion) or King's Court (from Dominion: Prosperity), you will only get one Coin token when you buy a card."
		},
		{
			"name" : "Plaza",
			"setId" : 10,
			"isAction" : true,
			"cost" : 4,
			"cards" : 1,
			"actions" : 2,
			"description" : "You may discard a Treasure card. If you do, take a Coin token.",
			"errata" : "First you draw a card and get +2 Actions; then you may discard a Treasure. You can discard the card you drew if it is a Treasure. If you discarded a Treasure card, you take a Coin token. Cards with multiple types, one of which is Treasure (such as Harem from Dominion: Intrigue), are Treasures."
		},
		{
			"name" : "Soothsayer",
			"setId" : 10,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 5,
			"description" : "Gain a Gold. Each other player gains a Curse. Each player who did draws a card.",
			"errata" : "The Gold and Curses come from the Supply and go into discard piles. If there is no Gold left, you do not gain one. If there are not enough Curses left to go around, deal them out in turn order, starting with the player to your left. Each player who gained a Curse draws a card. This is not optional. A player who did not gain a Curse, whether due to the Curses running out or due to some other reason, does not draw a card. A player who uses Watchtower (from Dominion: Prosperity) to trash the Curse did gain a Curse and so draws a card; a player who uses Trader (from Dominion: Hinterlands) to gain a Silver instead did not gain a Curse and so does not draw a card."
		},
		{
			"name" : "Stonemason",
			"setId" : 10,
			"isAction" : true,
			"cost" : 2,
			"overpay" : true,
			"description" : "[Action]: Trash a card from your hand. Gain 2 cards each costing less than it. [Overpay]: When you buy this, you may overpay for it. If you do, gain 2 Action cards each costing the amount you overpaid.",
			"errata" : "When you play this, trash a card from your hand, and gain two cards, each costing less than the card you trashed. Trashing a card is not optional. If you do not have any cards left in your hand to trash, you do not gain any cards. The two cards you gain can be different or the same. For example you could trash a Gold to gain a Duchy and a Silver. Gaining cards is not optional if you trashed a card. The gained cards come from the Supply and are put into your discard pile; if there are no cheaper cards in the Supply (for example if you trash a Copper), you do not gain any. If there is only one card in the Supply cheaper than the trashed card, you gain that one. The cards you gain are gained one at a time; this may matter with cards that do something when gained, such as Inn from Dominion: Hinterlands. When you buy this, you may choose to overpay for it. If you do, you gain two Action cards each costing exactly the amount you overpaid. The Action cards can be different or the same. For example, if you buy Stonemason for <6>, you could gain two Heralds. The Action cards come from the Supply and are put into your discard pile. If there are no cards with the appropriate cost in the Supply, you do not gain one. Overpaying with a Potion (from Dominion: Alchemy) will let you gain cards with Potion in the cost. Cards with multiple types, one of which is Action (such as Great Hall from Dominion: Intrigue), are Action cards. If you choose not to overpay, you will not gain any cards from that ability; it is not possible to use it to gain Action cards costing <0>."
		},
		{
			"name" : "Taxman",
			"setId" : 10,
			"isAction" : true,
			"isAttack" : true,
			"cost" : 4,
			"description" : "You may trash a Treasure from your hand. Each other player with 5 or more cards in hand discards a copy of it (or reveals a hand without it). Gain a Treasure card costing up to $3 more than the trashed card, putting it on top of your deck.",
			"errata" : "You may trash a Treasure card from your hand. This is optional. Cards with multiple types, one of which is Treasure (like Harem from Dominion: Intrigue), are Treasures. If you do trash a Treasure, each other player with at least five cards in hand discards a copy of it from her hand if she can, or reveals a hand with no copies of it, and you gain a Treasure costing up to <3> more than the trashed Treasure, putting it on top of your deck. If there are no cards in your deck, it becomes the only card in your deck. You do not have to gain a more expensive Treasure; you may gain a Treasure with the same cost, or a cheaper Treasure. You have to gain a card if you trashed one though, if possible. The gained Treasure comes from the Supply."
		}
	],
	"recommendedKingdoms" : [
		 {
			 "name" : "Introduction",
			 "cards" : ["Cache","Crossroads","Develop","Haggler","Jack of all Trades","Margrave","Nomad Camp","Oasis","Spice Merchant","Stables"]
		 },
		 {
			 "name" : "Fair Trades",
			 "cards" : ["Border Village","Cartographer","Develop","Duchess","Farmland","Ill-Gotten Gains","Noble Brigand","Silk Road","Stables","Trader"]
		 },
		 {
			 "name" : "Bargains",
			 "cards" : ["Border Village","Cache","Duchess","Fool's Gold","Haggler","Highway","Nomad Camp","Scheme","Spice Merchant","Trader"]
		 },
		 {
			 "name" : "Gambits",
			 "cards" : ["Cartographer","Crossroads","Embassy","Inn","Jack of all Trades","Mandarin","Nomad Camp","Oasis","Oracle","Tunnel"]
		 },
		 {
			 "name" : "Highway Robbery",
			 "cards" : ["Cellar","Library","Moneylender","Throne Room","Workshop","Highway","Inn","Margrave","Noble Brigand","Oasis"]
		 },
		 {
			 "name" : "Adventures Abroad",
			 "cards" : ["Adventurer","Chancellor","Festival","Laboratory","Remodel","Crossroads","Farmland","Fool's Gold","Oracle","Spice Merchant"]
		 },
		 {
			 "name" : "Money for Nothing",
			 "cards" : ["Coppersmith","Great Hall","Pawn","Shanty Town","Torturer","Cache","Cartographer","Jack of all Trades","Silk Road","Tunnel"]
		 },
		 {
			 "name" : "The Duke's Ball",
			 "cards" : ["Conspirator","Duke","Harem","Masquerade","Upgrade","Duchess","Haggler","Inn","Noble Brigand","Scheme"]
		 },
		 {
			 "name" : "Travelers",
			 "cards" : ["Cutpurse","Island","Lookout","Merchant Ship","Warehouse","Cartographer","Crossroads","Farmland","Silk Road","Stables"]
		 },
		 {
			 "name" : "Diplomacy",
			 "cards" : ["Ambassador","Bazaar","Caravan","Embargo","Smugglers","Embassy","Farmland","Ill-Gotten Gains","Noble Brigand","Trader"]
		 },
		 {
			 "name" : "Schemes and Dreams",
			 "cards" : ["Apothecary","Apprentice","Herbalist","Philosopher's Stone","Transmute","Duchess","Fool's Gold","Ill-Gotten Gains","Jack of all Trades","Scheme"]
		 },
		 {
			 "name" : "Wine Country",
			 "cards" : ["Apprentice","Familiar","Golem","University","Vineyard","Crossroads","Farmland","Haggler","Highway","Nomad Camp"]
		 },
		 {
			 "name" : "Instant Gratification",
			 "cards" : ["Bishop","Expand","Hoard","Mint","Watchtower","Farmland","Haggler","Ill-Gotten Gains","Noble Brigand","Trader"]
		 },
		 {
			 "name" : "Treasure Trove",
			 "cards" : ["Bank","Monument","Royal Seal","Trade Route","Venture","Cache","Develop","Fool's Gold","Ill-Gotten Gains","Mandarin"]
		 },
		 {
			 "name" : "Blue Harvest",
			 "cards" : ["Hamlet","Horn of Plenty","Horse Traders","Jester","Tournament","Fool's Gold","Mandarin","Noble Brigand","Trader","Tunnel"]
		 },
		 {
			 "name" : "Traveling Circus",
			 "cards" : ["Fairgrounds","Farming Village","Hunting Party","Jester","Menagerie","Border Village","Embassy","Fool's Gold","Nomad Camp","Oasis"]
		 },
		 {
			 "name" : "Forbidden Arts",
			 "cards" : ["Apprentice","Familiar","Possession","University","Cellar","Council Room","Gardens","Laboratory","Thief","Throne Room"]
		 },
		 {
			 "name" : "Potion Mixers",
			 "cards" : ["Alchemist","Apothecary","Golem","Herbalist","Transmute","Cellar","Chancellor","Festival","Militia","Smithy"]
		 },
		 {
			 "name" : "Chemistry Lesson",
			 "cards" : ["Alchemist","Golem","Philosopher's Stone","University","Bureaucrat","Market","Moat","Remodel","Witch","Woodcutter"]
		 },
		 {
			 "name" : "Servants",
			 "cards" : ["Golem","Possession","Scrying Pool","Transmute","Vineyard","Conspirator","Great Hall","Minion","Pawn","Steward"]
		 },
		 {
			 "name" : "Secret Research",
			 "cards" : ["Familiar","Herbalist","Philosopher's Stone","University","Bridge","Masquerade","Minion","Nobles","Shanty Town","Torturer"]
		 },
		 {
			 "name" : "Pools, Tools, and Fools",
			 "cards" : ["Apothecary","Apprentice","Golem","Scrying Pool","Baron","Coppersmith","Ironworks","Nobles","Trading Post","Wishing Well"]
		 },
		 {
			 "name" : "Bounty of the Hunt",
			 "cards" : ["Harvest","Horn of Plenty","Hunting Party","Menagerie","Tournament","Cellar","Festival","Militia","Moneylender","Smithy"]
		 },
		 {
			 "name" : "Bad Omens",
			 "cards" : ["Fortune Teller","Hamlet","Horn of Plenty","Jester","Remake","Adventurer","Bureaucrat","Laboratory","Spy","Throne Room"]
		 },
		 {
			 "name" : "Jester's Workshop",
			 "cards" : ["Fairgrounds","Farming Village","Horse Traders","Jester","Young Witch","Feast","Laboratory","Market","Remodel","Workshop","Chancellor"]
		 },
		 {
			 "name" : "Fast Laughs",
			 "cards" : ["Farming Village","Harvest","Horse Traders","Hunting Party","Jester","Minion","Nobles","Pawn","Steward","Swindler"]
		 },
		 {
			 "name" : "The Spice of Life",
			 "cards" : ["Fairgrounds","Horn of Plenty","Remake","Tournament","Young Witch","Coppersmith","Courtyard","Great Hall","Mining Village","Tribute","Wishing Well"]
		 },
		 {
			 "name" : "Small Victories",
			 "cards" : ["Fortune Teller","Hamlet","Hunting Party","Remake","Tournament","Conspirator","Duke","Great Hall","Harem","Pawn"]
		 },
		 {
			 "name" : "Beginners",
			 "cards" : ["Bank","Counting House","Expand","Goons","Monument","Rabble","Royal Seal","Venture","Watchtower","Worker's Village"]
		 },
		 {
			 "name" : "Friendly Interactive",
			 "cards" : ["Bishop","City","Contraband","Forge","Hoard","Peddler","Royal Seal","Trade Route","Vault","Worker's Village"]
		 },
		 {
			 "name" : "Big actions",
			 "cards" : ["City","Expand","Grand Market","King's Court","Loan","Mint","Quarry","Rabble","Talisman","Vault"]
		 },
		 {
			 "name" : "Biggest Money",
			 "cards" : ["Bank","Grand Market","Mint","Royal Seal","Venture","Adventurer","Laboratory","Mine","Moneylender","Spy"]
		 },
		 {
			 "name" : "The King's Army",
			 "cards" : ["Expand","Goons","King's Court","Rabble","Vault","Bureaucrat","Council Room","Moat","Spy","Village"]
		 },
		 {
			 "name" : "The Good Life",
			 "cards" : ["Contraband","Counting House","Hoard","Monument","Mountebank","Bureaucrat","Cellar","Chancellor","Gardens","Village"]
		 },
		 {
			 "name" : "Paths to Victory",
			 "cards" : ["Bishop","Counting House","Goons","Monument","Peddler","Baron","Harem","Pawn","Shanty Town","Upgrade"]
		 },
		 {
			 "name" : "All Along the Watchtower",
			 "cards" : ["Hoard","Talisman","Trade Route","Vault","Watchtower","Bridge","Great Hall","Mining Village","Pawn","Torturer"]
		 },
		 {
			 "name" : "Lucky Seven",
			 "cards" : ["Bank","Expand","Forge","King's Court","Vault","Bridge","Coppersmith","Swindler","Tribute","Wishing Well"]
		 },
		 {
			 "name" : "Victory Dance",
			 "cards" : ["Bridge","Duke","Great Hall","Harem","Ironworks","Masquerade","Nobles","Pawn","Scout","Upgrade"]
		 },
		 {
			 "name" : "Secret Schemes",
			 "cards" : ["Conspirator","Harem","Ironworks","Pawn","Saboteur","Shanty Town","Steward","Swindler","Trading Post","Tribute"]
		 },
		 {
			 "name" : "Best Wishes",
			 "cards" : ["Coppersmith","Courtyard","Masquerade","Scout","Shanty Town","Steward","Torturer","Trading Post","Upgrade","Wishing Well"]
		 },
		 {
			 "name" : "Deconstruction",
			 "cards" : ["Bridge","Mining Village","Remodel","Saboteur","Secret Chamber","Spy","Swindler","Thief","Throne Room","Torturer"]
		 },
		 {
			 "name" : "Hand Madness",
			 "cards" : ["Bureaucrat","Chancellor","Council Room","Courtyard","Mine","Militia","Minion","Nobles","Steward","Torturer"]
		 },
		 {
			 "name" : "Underlings",
			 "cards" : ["Baron","Cellar","Festival","Library","Masquerade","Minion","Nobles","Pawn","Steward","Witch"]
		 },
		 {
			 "name" : "First Game",
			 "cards" : ["Cellar","Market","Militia","Mine","Moat","Remodel","Smithy","Village","Woodcutter","Workshop"]
		 },
		 {
			 "name" : "Big Money",
			 "cards" : ["Adventurer","Bureaucrat","Chancellor","Chapel","Feast","Laboratory","Market","Mine","Moneylender","Throne Room"]
		 },
		 {
			 "name" : "Interaction",
			 "cards" : ["Bureaucrat","Chancellor","Council Room","Festival","Library","Militia","Moat","Spy","Thief","Village"]
		 },
		 {
			 "name" : "Size Distortion",
			 "cards" : ["Cellar","Chapel","Feast","Gardens","Laboratory","Thief","Village","Witch","Woodcutter","Workshop"]
		 },
		 {
			 "name" : "Village Square",
			 "cards" : ["Bureaucrat","Cellar","Festival","Library","Market","Remodel","Smithy","Throne Room","Village","Woodcutter"]
		 },
		 {
			 "name" : "High Seas",
			 "cards" : ["Bazaar","Caravan","Embargo","Explorer","Haven","Island","Lookout","Pirate Ship","Smugglers","Wharf"]
		 },
		 {
			 "name" : "Buried Treasure",
			 "cards" : ["Ambassador","Cutpurse","Fishing Village","Lighthouse","Outpost","Pearl Diver","Tactician","Treasure Map","Warehouse","Wharf"]
		 },
		 {
			 "name" : "Shipwrecks",
			 "cards" : ["Ghost Ship","Merchant Ship","Native Village","Navigator","Pearl Diver","Salvager","Sea Hag","Smugglers","Treasury","Warehouse"]
		 },
		 {
			 "name" : "Reach for Tomorrow",
			 "cards" : ["Adventurer","Cellar","Council Room","Cutpurse","Ghost Ship","Lookout","Sea Hag","Spy","Treasure Map","Village"]
		 },
		 {
			 "name" : "Repetition",
			 "cards" : ["Caravan","Chancellor","Explorer","Festival","Militia","Outpost","Pearl Diver","Pirate Ship","Treasury","Workshop"]
		 },
		 {
			 "name" : "Give and Take",
			 "cards" : ["Ambassador","Fishing Village","Haven","Island","Library","Market","Moneylender","Salvager","Smugglers","Witch"]
		 },
		 {
			 "name" : "Grim Parade",
			 "cards" : ["Armory", "Band of Misfits", "Catacombs", "Cultist", "Forager", "Fortress", "Knights", "Market Square", "Procession", "Hunting Grounds"]
		 },
		 {
			 "name" : "Playing Chess With Death",
			 "cards" : ["Bandit Camp", "Graverobber", "Junk Dealer", "Mystic", "Pillage", "Rats", "Sage", "Scavenger", "Storeroom", "Vagrant"]
		 },
		 {
			 "name" : "High and Low",
			 "cards" : ["Hermit", "Hunting Grounds", "Mystic", "Poor House", "Wandering Minstrel", "Cellar", "Moneylender", "Throne Room", "Witch", "Workshop"]
		 },
		 {
			 "name" : "Chivalry and Revelry",
			 "cards" : ["Altar", "Knights", "Rats", "Scavenger", "Squire", "Festival", "Gardens", "Laboratory", "Library", "Remodel"]
		 },
		 {
			 "name" : "Prophecy",
			 "cards" : ["Armory", "Ironmonger", "Mystic", "Rebuild", "Vagrant", "Baron", "Conspirator", "Great Hall", "Nobles", "Wishing Well"]
		 },
		 {
			 "name" : "Invasion",
			 "cards" : ["Beggar", "Marauder", "Rogue", "Squire", "Urchin", "Harem", "Mining Village", "Swindler", "Torturer", "Upgrade"]
		 },
		 {
			 "name" : "Watery Graves",
			 "cards" : ["Count", "Graverobber", "Hermit", "Scavenger", "Urchin", "Native Village", "Pirate Ship", "Salvager", "Treasure Map", "Treasury"]
		 },
		 {
			 "name" : "Peasants",
			 "cards" : ["Death Cart", "Feodum", "Poor House", "Urchin", "Vagrant", "Fishing Village", "Haven", "Island", "Lookout", "Warehouse"]
		 },
		 {
			 "name" : "Infestations",
			 "cards" : ["Armory", "Cultist", "Feodum", "Market Square", "Rats", "Wandering Minstrel", "Apprentice", "Scrying Pool", "Transmute", "Vineyard"]
		 },
		 {
			 "name" : "Lamentations",
			 "cards" : ["Beggar", "Catacombs", "Counterfeit", "Forager", "Ironmonger", "Pillage", "Apothecary", "Golem", "Herbalist", "University"]
		 },
		 {
			 "name" : "One Man's Trash",
			 "cards" : ["Counterfeit", "Forager", "Graverobber", "Market Square", "Rogue", "City", "Grand Market", "Monument", "Talisman", "Venture"]
		 },
		 {
			 "name" : "Honor Among Thieves",
			 "cards" : ["Bandit Camp", "Procession", "Rebuild", "Rogue", "Squire", "Forge", "Hoard", "Peddler", "Quarry", "Watchtower"]
		 },
		 {
			 "name" : "Dark Carnival",
			 "cards" : ["Band of Misfits", "Cultist", "Fortress", "Hermit", "Junk Dealer", "Knights", "Fairgrounds", "Hamlet", "Horn of Plenty", "Menagerie"]
		 },
		 {
			 "name" : "To the Victor",
			 "cards" : ["Bandit Camp", "Counterfeit", "Death Cart", "Marauder", "Pillage", "Sage", "Harvest", "Hunting Party", "Remake", "Tournament"]
		 },
		 {
			 "name" : "Far From Home",
			 "cards" : ["Beggar", "Count", "Feodum", "Marauder", "Wandering Minstrel", "Cartographer", "Develop", "Embassy", "Fool's Gold", "Haggler"]
		 },
		 {
			 "name" : "Expeditions",
			 "cards" : ["Altar", "Catacombs", "Ironmonger", "Poor House", "Storeroom", "Crossroads", "Farmland", "Highway", "Spice Merchant", "Tunnel"]
		 }
	]
}

/*
Stash	Promo	Treasure			5			2			When you shuffle, you may put this anywhere in your deck.	Feb-10																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																			
Bag of Gold	Cornucopia	Action	Prize		0*		1				Gain a Gold, putting it on top of your deck. (This is not in the Supply)	Jun-11																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																			
Diadem	Cornucopia	Treasure	Prize		0*			2			When you play this, +1 Coin per unused Action you have (Action, not Action card). (This is not in the Supply)	Jun-11																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																			
Followers	Cornucopia	Action	Attack	Prize	0*						Gain an Estate. Each other player gains a Curse and discards down to 3 cards in hand. (This is not in the Supply.)	Jun-11																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																			
Princess	Cornucopia	Action	Prize		0*				1		While this is in play, cards cost 2 "coins" less, but not less than 0 "coins". (This is not in the Supply.)	Jun-11																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																			
Trusty Steed	Cornucopia	Action	Prize		0*						Choose two: +2 cards; or +2 actions; or +2 "coins"; or gain 4 Silvers and put your deck into your discard pile.  (This is not in the Supply.)	Jun-11																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																			
Walled Village	Promo	Action			4	1	2				At the start of Clean-up, if you have this and no other Action card in play, you may put this on top of your deck.	Jun-11																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																			
*/